<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Criar v&iacute;deos</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	
  <div id="helpheader"> <a class="bread" href="index.html"> Ajuda do Sweet Home 3D</a> 
    > <A class="bread" HREF="tocCreatingPhotos.html">Crair fotografias e v&iacute;deos</A></div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	  <td valign="bottom" height="32"><font id="topic">Criar v&iacute;deos</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Para criar um v&iacute;deo 3D da sua casa, escolha <i>Vista 3D &gt; Criar v&iacute;deo...</i> ou clique na ferramenta <i>Criar 
	v&iacute;deo</i>.
    <img src="../images/createVideoTool.png" alt="Video Creation tool" width="24" height="24" align="absmiddle">&nbsp;
        <p>Isto vai abrir uma caixa de di&aacute;logo semelhante &agrave; de cria&ccedil;&atilde;o 
		<a href="creatingPhotos.html">cria&ccedil;&atilde;o de fotografias</a>.</p>
        <p align="center"><img src="images/creatingVideos.jpg"></p>
        <p>No topo da janela aparece a planta da sua casa, sobre a qual vai ser desenhado o caminho do v&iacute;deo virtual. Abaixo da planta, os 
		bot&otilde;es <i>Gravar</i>, <i>Reproduzir</i> e <i>Apagar</i> ajudam a marcar os pontos por onde a c&acirc;mara deve passar, reproduzir o 
		caminho gravado ou remover alguns pontos do caminho. <br> A lista pendente <i>Formato do v&iacute;deo</i> permite-lhe escolher o tamanho, 
		propor&ccedil;&atilde;o e imagens/seg do v&iacute;deo, entre os formatos mais comuns.<br>
        O deslizador <i>Qualidade</i> e possivelmente outros campos s&atilde;o os mesmos que os encontrados na janela 
		<a href="creatingPhotos.html">Criar fotografias</a>.</p>
        <p>Para criar um v&iacute;deo, escolha a localiza&ccedil;&atilde;o inicial da c&acirc;mara de v&iacute;deona vista 3D da janela principal do
		Sweet Home 3D, e clique no bot&atilde;o vermelho na janela de cria&ccedil;&atilde;o de v&iacute;deo. Mova-se para a pr&oacute;xima 
		posi&ccedil;&atilde;o onde a c&acirc;mara deve passar e clique novamente no bot&atilde;o vermelho. Repita estes passos para todos os pontos 
		que quer incluir no v&iacute;deo<br>
        Cada vez que clica no bot&atilde;o vermelho, um novo ponto &eacute; acrescentado &agrave; planta mostrada na janela de cria&ccedil;&atilde;o 
		de v&iacute;deo para lhe mostrar o caminho da c&acirc;mara.<br>
        Quando tiver terminado a selec&ccedil;&atilde;o do caminho, clique em <b>Criar</b> para come&ccedil;ar o c&aacute;lculo do v&iacute;deo.
		Quando o c&aacute;lculo terminar, clique em <b>Gravar...</b> para gravar o v&iacute;deo num ficheiro Quicktime. Pode ver o v&iacute;deo com 
		v&aacute;rias ferramentas diferentes, como por exemplo o <a href="http://www.videolan.org/">VLC</a> ou o 
		<a href="http://smplayer.sourceforge.net/">SMPlayer</a>, ou alterar o formato para outro &agrave; sua escolha com outras ferramentas como o 
		<a href="http://www.pcfreetime.com/pt/index.html">Format Factory.<br>
        </p>
        </td>
	</tr>
</table>
<div id="taskbox">
<table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
	<tr valign="top" BGCOLOR="#eeeeee">
	<td bgcolor="#eeeeee" width="98%">
	<table border="0" cellspacing="0" cellpadding="4">
            <tr valign="top"> 
              <td width="16"><p>&#149;</p></td>
              <td> <p>Use os bot&otilde;es de reprodu&ccedil;&atilde;o para verifica&ccedil;&otilde;es grosseiras do caminho da c&acirc;mara na vista
				   3D da janela principal do Sweet Home 3D, porque uma vez iniciado, o c&aacute;lculo do v&iacute;deo pode levar minutos ou horas,
				   dependendo da sua casa, da qualidade escolhida e das capacidades do seu computador. </p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>A eleva&ccedil;&atilde;o vertical da c&acirc;mara, os seus dois &acirc;ngulos de rota&ccedil;&atilde;o e o seu campo de vis&atilde;o
			  s&atilde;o tamb&eacute;m armazenados em cada localiza&ccedil;&atilde;o gravada. Esta informa&ccedil;&atilde;o &eacute; levada em 
			  considera&ccedil;&atilde;o durante o processamento do v&iacute;deo e permite-lhe criar toda a esp&eacute;cie de 
			  anima&ccedil;&otilde;es. <br>
              Nos dois melhores n&iacute;veis de qualidade, pode tamb&eacute;m definir uma hora diferente em cada ponto gravado, mesmo que n&atilde;o 
			  tenha movido a c&acirc;mara entre dois pontos. Se a hora definida no ponto inicial for ao princ&iacute;pio do dia e a hora no segundo 
			  ponto for ao fim do dia, vai ver uma anima&ccedil;&atilde;o mostrando que partes da divis&atilde;o recebem luz direta do Sol durante 
			  um dia.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>A caixa de di&aacute;logo <i>Criar v&iacute;deo</i> n&atilde;o &eacute; modal. Isto quer dizer que n&atilde;o bloqueia a 
			  introdu&ccedil;&atilde;o de dados noutras janelas e permite-lhe alterar o ponto de vista actual na vista 3D da janela principal antes 
			  de gravar uma nova localiza&ccedil;&atilde;o da c&acirc;mara, mesmo que esta caixa de di&aacute;logo esteja aberta. </p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p> As altera&ccedil;&otilde;es que efetuar &agrave; sua casa enquanto o v&iacute;deo &eacute; calculado n&atilde;o afetam o 
			  resultado final do v&iacute;deo.</p></td>
            </tr>
          </table>
	 </td>
	</tr>
</table></div>
</div>
</body>

</html>
