<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Criar fotografias</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	
  <div id="helpheader"> <a class="bread" href="index.html"> Ajuda do Sweet Home 3D</a> 
    > <A class="bread" HREF="tocCreatingPhotos.html">Criar fotografias e v&iacute;deos</A></div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	  <td valign="bottom" height="32"><font id="topic">Criar fotografias</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr> 
      <td><p>Para criar fotografias ou imagens da sua casa, escolha <i>Vista 3D &gt; Criar fotografia...</i> ou clique na ferramenta 
	  <i>Criar fotografia</i>.
        <blockquote> 
          <img src="../images/createPhotoTool.png" alt="Photo Creation tool" width="24" height="24" align="absmiddle">&nbsp;</p>
        </blockquote>
        <p>Surge a caixa de di&aacute;logo abaixo, mostrando o tamanho, qualidade e possivelmente outras defini&ccedil;&otilde;es usadas durante 
		o processo de cria&ccedil;&atilde;o da imagem, assim como o bot&atilde;o <i>Criar</i>, que inicia o c&aacute;lculo da imagem e o bot&atilde;o
		 <i>Gravar...</i>, que lhe permitir&aacute; gravar a imagem mostrada ap&oacute;s o c&aacute;lculo.</p>
        <p align="center"><img src="images/creatingPhotos.jpg"></p>
        <p>Se n&atilde;o est&aacute; contente com o tamanho predefinido da imagem, escolha uma largura e uma altura diferentes. Quando a caixa 
		<i>Aplicar propor&ccedil;&otilde;es</i> est&aacute; seleccionada, a altura da imagem &eacute; actualizada automaticamente com as altera&ccedil;&otilde;es 
		na largura, mantendo a proporcionalidade de acordo com as defini&ccedil;&otilde;es da lista pendente ao lado direito.<br>
          O seletor <i>Qualidade</i> permite-lhe escolher entre os quatro n&iacute;veis seguintes, desde a pior &agrave; melhor 
		  qualidade ou do mais r&aacute;pido ao mais lento motor de interpreta&ccedil;&atilde;o, dependendo da sua maneira de pensar:</p>
            </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
            <tr valign="top"> 
              <td width="240"><img src="../images/photoQuality0.jpg" alt="Quality 0" width="240" height="160" border="1" align="absmiddle"  ></td>
              <td width="209"><p>1. O n&iacute;vel mais baixo de qualidade, corresponde ao que v&ecirc; na vista 3D com o mesmo campo de vis&atilde;o.</p></td>
              <td width="8" rowspan="3">&nbsp;&nbsp;</td>
              <td width="242"><img src="../images/photoQuality2.jpg" alt="Quality 2" width="240" height="160" border="1" align="absmiddle"  ></td>
              <td width="214">3. O terceiro n&iacute;vel de qualidade usa um processo de interpreta&ccedil;&atilde;o completamente diferente 
			  chamado <i>Ilumina&ccedil;&atilde;o global </i>com sombras calculadas a partir da localiza&ccedil;&atilde;o do Sol e de outras luzes. </td>
            </tr>
            <tr valign="top"> 
              <td height="5" colspan="2" ></td>
              <td colspan="2"></td>
            </tr>
            <tr valign="top"> 
              <td><img src="../images/photoQuality1.jpg" alt="Quality 1" width="240" height="160" border="1" align="absmiddle"  ></td>
              <td><p>2. O segundo n&iacute;vel de qualidade &eacute; igual ao primeiro mas com sombras por baixo da mob&iacute;lia assente no ch&atilde;o, 
			  acrescentando realidade &agrave; casa.</p></td>
              <td><img src="../images/photoQuality3.jpg" alt="Quality 3" width="240" height="160" border="1" align="absmiddle" ></td>
              <td>4. O melhor n&iacute;vel de qualidade &eacute; semelhante ao anterior. Os detalhes s&atilde;o mais pormenorizados e as superf&iacute;cies 
			  brilhantes s&atilde;o mais bonitas.</td>
            </tr>
          </table>
      </td>
    </tr>
  </table>
</div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Nos dois melhores n&iacute;veis de qualidade, a imagem final depende da localiza&ccedil;&atilde;o e pot&ecirc;ncia das luzes. Por predefini&ccedil;&atilde;o, 
	a imagem &eacute; calculada ao meio-dia com luzes adicionais colocadas no centro do tecto de cada <a href="drawingRooms.html">divis&atilde;o</a>. 
	Se quer controlar melhor as fontes de luz na sua casa, poder&aacute; desmarcar a caixa <i>Adicionar luzes de tecto</i>, adicionar objectos da 
	categoria <i>Ilumina&ccedil;&atilde;o</i> na planta e ajustar a sua pot&ecirc;ncia no seu indicador pr&oacute;prio ou 
	<a href="editingFurniture.html">editando</a> os seus atributos. A luz do Sol, a cor e a direc&ccedil;&atilde;o dos seus raios, dependem da 
	hora do dia e da data seleccionada, mas tamb&eacute;m da direc&ccedil;&atilde;o do Norte, da localiza&ccedil;&atilde;o geogr&aacute;fica e do 
	Meridiano, sendo os &uacute;ltimos par&acirc;metros geridos pela <a href="editingCompass.html">b&uacute;ssola</a>. O brilho global da imagem 
	depende tamb&eacute;m do n&iacute;vel de brilho definido no painel de <a href="editing3DView.html">Modifica&ccedil;&atilde;o da vista 3D</a>.<br>
	Finalmente, a janela <i>Criar fotografia</i> permite-lhe escolher entre os quatro seguintes tipos de lentes:</p>
        <table border="0" align="center" cellpadding="0" cellspacing="5">
          <tr align="center"> 
            <td><img src="../images/defaultLens.jpg" width="240" height="160" border="1"></td>
            <td rowspan="2">&nbsp;&nbsp;&nbsp;</td>
            <td><img src="../images/depthOfFieldLens.jpg" width="240" height="160" border="1"></td>
          </tr>
          <tr> 
            <td align="center" valign="top">Lente <i>Predefinida</i><br>
              &nbsp;</td>
            <td align="center" valign="top">Lente <i>Profundidade de campo</i></td>
          </tr>
		  <tr align="center"> 
            <td><img src="../images/fisheyeLens.png" width="120" height="120"></td>
            <td rowspan="2">&nbsp;&nbsp;&nbsp;</td>
            <td><img src="../images/sphericalLens.jpg" width="240" height="120" border="1" ></td>
          </tr>
          <tr> 
            <td align="center" valign="top">Lente <i>Grande-angular</i></td>
            <td align="center" valign="top">Lente <i>Panor&acirc;mica</i></td>
          </tr>
        </table>
        <p>Se quer calcular um grupo de fotografias num mesmo lote, armazene os pontos de vista em que est&aacute; interessado. Escolha  
		<i>Vista 3D &gt; Armazenar ponto de vista...</i> e seleccione <i>Vista 3D &gt; Criar fotografias em pontos de vistas...</i>. Surge uma
		caixa de di&aacute;logo onde pode escolher o tamanho e a qualidade da imagem e o formato do ficheiro das imagens, antes de as calcular e 
		gravar numa pasta &agrave; sua escolha. Nos dois melhores n&iacute;veis de qualidade, a data/hora e a lente usada para um determinado ponto 
		de vista ser&atilde;o os &uacute;ltimos valores que introduziu na janela <i>Criar fotografia</i> no momento em que armazenou ou modificou
		esse ponto de vista. Se nunca abriu a janela <i>Criar fotografia</i> ou alterou a data/hora naquela janela, a data/hora ser&aacute;
		meio-dia no dia em que a casa foi criada.</p>
      <p align="center"><img src="images/creatingPhotosAtPointsOfView.png" alt="Create photos at points of view"></p></td>
	</tr>
</table>
<div id="taskbox">
<table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
	<tr valign="top" BGCOLOR="#eeeeee">
	<td bgcolor="#eeeeee" width="98%">
	<table border="0" cellspacing="0" cellpadding="4">
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>A lente panor&acirc;mica calcula imagens equi-rectangulares. Estas imagens de aspeto estranho t&ecirc;m sempre a altura igual 
			  a metade da largura (propor&ccedil;&otilde;es 2/1) e s&atilde;o &uacute;teis para gerar panor&acirc;micas com o Quicktime VR, 
			  aplica&ccedil;&otilde;es Flash ou Java, com ferramentas como PanoSalado ou PTViewer.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Na categoria <i>Ilumina&ccedil;&atilde;o</i> do cat&aacute;logo, h&agrave; alguma ilumina&ccedil;&atilde;o especial, chamada 
			  <i>Fonte de luz</i> e representada por uma l&acirc;mpada incandescente. Estas fontes de luz n&atilde;o t&ecirc;m 
			  representa&ccedil;&atilde;o f&iacute;sica e s&oacute; podem ser vistas na vista 3D se seleccionadas. S&oacute; s&atilde;o usadas para 
			  iluminar a vista 3D nos dois melhores n&iacute;veis de qualidade. Aument&aacute;-las vai produzir sombras mais suaves.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Nos dois melhores n&iacute;veis de qualidade, a cor dos raios solares depende da eleva&ccedil;&atilde;o do Sol no c&eacute;u 
			  durante o dia e o Sol n&atilde;o produz luz &agrave; noite. Se seleccionou uma cor para o c&eacute;u na janela 
			  <a href="editing3DView.html">3D view</a> ou se o modo actual &eacute; <i>Vista a&eacute;rea</i>, &eacute; usada uma imagem do c&eacute;u, 
			  calculada de acordo com a hora do dia. Se escolheu uma textura para o c&eacute;u, essa textura ser&aacute; sempre usada no modo de 
			  <i>visita virtual</i> seja qual for a hora do dia.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Se a imagem calculada est&aacute; completamente preta, verifique se o visitante virtual est&aacute; ou n&atilde;o numa 
			  parede e, &agrave; noite, se h&aacute; luzes vis&iacute;veis com pot&ecirc;ncia superior a 0 ou se a caixa <i>Adicionar luzes de tecto</i> 
			  est&aacute; marcada. Se a hora que introduziu for uma hora do dia, <a href="editingCompass.html">verifique</a> tamb&eacute;m se a
              localiza&ccedil;&atilde;o geogr&aacute;fica e o fuso hor&aacute;rio s&atilde;o consistentes. Lembre-se que quando &eacute; meio-dia
              na Europa Central ainda &eacute; noite na Calif&oacute;rnia.</p>
                </td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>No modo <i>Vista a&eacute;rea</i>, os tectos das divis&otilde;es n&atilde;o s&atilde;o vistos. Se os quer ver nos dois 
			  melhores n&iacute;veis de qualidade, use o modo <i>Visita virtual</i> e eleve o ponto de vista do visitante virtual.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Em determinado n&iacute;vel de qualidade, pode sempre melhorar a qualidade da imagem escolhendo um tamanho maior para a imagem
			  e depois utilizar um editor de imagem (como o GIMP) para reduzir o tamanho da imagem calculada.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Nos dois níveis de melhor qualidade, a lista pendente do processador permite-lhe escolher o motor de entrega que calculará 
              a imagem (não disponível em todos os sistemas). Se quiser desenhar imagens mais rapidamente, experimente o YafaRay e/ou apague algumas 
              luzes inúteis. Uma imagem de maiores dimensões também demorará mais tempo a ser calculada.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>As caixas de di&aacute;logo <i>Criar fotografias</i> e <i>Criar fotografias em pontos de vista</i> n&atilde;o s&atilde;o modais.
			  Isto significa que n&atilde;o bloqueiam a introdu&ccedil;&atilde;o de dados noutras janelas e permitem-lhe modificar a sua casa ou o 
			  seu ponto de vista na janela principal, enquanto uma destas caixas est&aacute; aberta. </p></td>
            </tr>
            <tr valign="top"> 
              <td width="16"><p>&#149;</p></td>
              <td> <p> As altera&ccedil;&otilde;es que efetuar enquanto uma fotografia &eacute; calculada n&atilde;o afetam o resultado do c&aacute;lculo 
			  actual.</p></td>
            </tr>
          </table>
	 </td>
	</tr>
</table></div>
</div>
</body>

</html>
