<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Desenhar divis&otilde;es</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocCreating.html">Criar casas, paredes e
										   mob&iacute;lia</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Desenhar divis&otilde;es</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Para desenhar divis&otilde;es, escolha <i>Planta &gt; Criar divis&otilde;es</i> ou seleccione a ferramenta 
	    <p><img src="../images/createRoomsTool.png" alt="Room Creation mode tool" width="24" height="24" align="absmiddle">&nbsp;<i>Criar
	        divis&otilde;es</i></p>
	    <p>Pode criar uma nova divis&atilde;o ou superf&iacute;cie na planta usando qualquer um destes processos:</p>
	  <ul>
	    <li>clique em cada canto da divis&atilde;o e depois fa&ccedil;a duplo clique no &uacute;ltimo canto ou pressione <i>Esc</i> depois de 
		    adicionar o &uacute;ltimo canto; </li>
		<li>fa&ccedil;a duplo clique dentro de qualquer superf&iacute;cie <b>fechada</b> existente (i.e. rodeada por 
		    <a href="drawingWalls.html">paredes</a>).</li>
	  </ul>
	  <p>Quando desenha uma divis&atilde;o ponto por ponto com o magnetismo activado, surge um ponto colorido para o ajudar a clicar em cada canto
	     da divis&atilde;o. Uma divis&atilde;o criada com duplo clique vai cobrir a &aacute;rea do ch&atilde;o de parede a parede que rodeiem o 
		 ponto onde clicou, e vai incluir tamb&amp;eacute;m metade de cada ombreira das portas colocadas nestas paredes. Esta funcionalidade 
		 assegura que as divis&otilde;es se unam correctamente na vista 3D quando as portas entre elas estejam abertas.<br>
	     Assim, a menos que queira criar uma superf&iacute;cie especial n&atilde;o ligada a paredes (como caminhos exteriores), deve come&ccedil;ar por
		 <a href="drawingWalls.html">desenhar paredes</a> e <a href="addingFurniture.html">adicionar portas</a> &agrave; sua casa para beneficiar da
		 capacidade do programa de mostrar linhas de alinhamento e calcular divis&otilde;es, incluindo metade da ombreira de cada porta.<br>
	     Novas divis&otilde;es s&atilde;o simultaneamente desenhadas na planta e na vista 3D.</p>
	  <table border="0" align="center" cellpadding="0" cellspacing="5">
        <tr>
          <td align="center"><img src="../images/drawingRooms1.png" alt="Drawing rooms with clicks" width="335" height="190"></td>
          </tr>
        <tr align="center">
          <td>Desenhar uma divis&atilde;o ponto por ponto</td>
          </tr>
      </table>	  
	  <br>
	  <table border="0" align="center" cellpadding="0" cellspacing="5">
        <tr>
          <td align="center"><img src="../images/drawingRooms2.png" alt="Drawing rooms with double-click" width="335" height="190"></td>
        </tr>
        <tr align="center">
          <td>Criar com um duplo clique <br>
            uma divis&atilde;o que inclua metade de uma ombreira</td>
        </tr>
      </table>	  
	  <p>Para terminar a cria&ccedil;&atilde;o de divis&otilde;es, escolha <i>Planta &gt; Seleccionar </i> ou seleccione a ferramenta
	  <img src="../images/selectTool.png" alt="Select tool" width="24" height="24" align="absmiddle">&nbsp; <i>Seleccionar</i>
	  (ou outra ferramenta).</p>	  
	  </td>
	</tr>
</table>
<div id="taskbox">
<table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
	<tr valign="top" BGCOLOR="#eeeeee">
	<td bgcolor="#eeeeee" width="98%">
	<table border="0" cellspacing="0" cellpadding="4">
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Novas divis&otilde;es t&ecirc;m que ter pelo menos tr&ecirc;s cantos para existirem (uma divis&atilde;o criada com um clique e 
			 depois duplo clique ser&aacute; recusada).</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Criar divis&otilde;es com duplo clique s&oacute; inclui a &aacute;rea de metade das ombreiras das portas com uma cota igual a zero. 
			 Pode aumentar a cota das portas que devem ser ignoradas durante a cria&ccedil;&atilde;o de uma divis&atilde;o (1 mm &eacute; suficiente)</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Para o ajudar a desenhar divis&otilde;es com precis&atilde;o, use sugest&otilde;es, linhas de alinhamento e pontos-guia de 
		  intercep&ccedil;&atilde;o de paredes. Se pressionar <i>Enter</i> com o foco na planta, os valores mostrados na caixa tornam-se 
		  edit&aacute;veis, permitindo-lhe introduzir o comprimento e o &acirc;ngulo do segmento actual com o teclado. Se ainda n&atilde;o 
		  come&ccedil;ou a criar a divis&atilde;o a caixa mostra as coordenadas desse ponto e, a partir do terceiro ponto, um campo adicional de texto <i>Diagonal</i>, 
		  permitir-lhe-á introduzir o comprimento da diagonal que une o ponto actual ao último ponto anterior, para ajudar a desenhar a sala por triangulação.<br>
		  Use as setas <i>para cima</i>, <i>para baixo</i> ou a tecla <i>Tab</i> para editar os valores e pressione <i>Enter</i> para confirmar os valores 
		  introduzidos. Se quiser voltar a usar o rato, simplesmente mova-o sobre a planta.</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Se quiser desativar o magnetismo nos pontos de intercep&ccedil;&atilde;o das paredes e nos &acirc;ngulos das linhas que desenha, 
		     fa&ccedil;a-o nas <a href="editingPreferences.html">prefer&ecirc;ncias</a>, ou pressione <i>Alt</i> no Windows, <i>cmd</i> em Mac OS X 
			 ou <i>Shift</i> +<i> Alt</i> em Linux.</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Uma vez criada a nova divis&atilde;o, pode <a href="editingRooms.html">alterar</a> a sua localiza&ccedil;&atilde;o, nome, cores e 
		     texturas na vista 3D e definir se a sua &aacute;rea &eacute; mostrada ou n&atilde;o.</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>As unidades mostradas na divis&atilde;o, r&eacute;guas e grelhas da planta s&atilde;o, por predefini&ccedil;&atilde;o, as do seu 
			 pa&iacute;s. Pode usar mil&iacute;metros, cent&iacute;metros, metros ou polegadas. Escolha-as nas 
			 <a href="editingPreferences.html">prefer&ecirc;ncias</a>. Se escolher polegadas, a &aacute;rea da divis&atilde;o &eacute; mostrada em 
			 p&eacute;s quadrados, sen&atilde;o &eacute; mostrada em metros quadrados.</td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
            <td> 
			  <p>Escolha <i>Planta &gt; Ampliar</i> ou <i>Planta &gt; Reduzir</i> para alterar a escala da planta, ou use a roda do rato, mantendo 
			     premida a tecla <i>Ctrl</i> (ou <i>cmd</i> em Mac OS X).
			</td>
	    </tr>
	  <tr valign="top">
	    <td>
	      <p>&#149;</p>
	      </td>
	    <td>
          <p>Use a <a href="editing3DView.html">Vista a&eacute;rea</a> predefinida enquanto desenha novas divis&otilde;es, obter&aacute; um ponto de 
		  vista mais &uacute;til da sua casa na vista 3D.</p>
	      </td>
	    </tr>
	  <tr valign="top"><td width="16"><p>&#149;</p></td><td>
	<p>Enquanto a ferramenta <i>Criar divis&otilde;es</i> estiver seleccionada, algumas ferramentas e menus est&atilde;o desactivados. Se precisar
	   destas ferramentas, seleccione a ferramenta 
	   <img src="../images/selectTool.png" alt="Select tool" width="24" height="24" align="absmiddle">&nbsp; <i>Seleccionar</i> novamente.</p>
	</td>
	</tr></table>
	 </td>
	</tr>
</table></div>
</div>
</body>

</html>
