<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Editar paredes</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocEditing.html">Editar
					      prefer&ecirc;ncias, planta e vista 3D</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Editar paredes</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Pode editar a localiza&ccedil;&atilde;o e o comprimento das paredes da casa, com o rato ou escolhendo <i>Planta &gt; Modificar paredes...</i>.<br>
           Para editar paredes com o rato, seleccione-as primeiro na planta. Clique numa parede na planta para a seleccionar. Para seleccionar 
		   m&uacute;ltiplas paredes desenhe uma selec&ccedil;&atilde;o rectangular &agrave; volta delas ou clique nas paredes enquanto mantem 
		   pressionada a tecla <i>Shift</i>.<br>
           Para mover as paredes seleccionadas, coloque o ponteiro do rato dentro da caixa de selec&ccedil;&atilde;o, arraste-a com o rato ou use as 
		   setas do teclado.</p>
        <p>Quando <b>uma</b> parede est&aacute; seleccionada na planta, pode tamb&eacute;m mover os seus pontos inicial e final, com o indicador de 
		   tamanho que aparece em cada ponta da parede seleccionada.</p>
        <p align="center"><img src="../images/wallEnds.png" width="320" height="80"></p>
    </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td nowrap><p>1.</p>
            </td>
            <td><p>O indicador de tamanho inicial mostra o ponto que pode arrastar para mover o ponto inicial da parede.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>2.</p>
            </td>
            <td><p>O indicador de in&iacute;cio da parede mostra em que ponto come&ccedil;a uma parede.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>3.</p>
            </td>
            <td><p>O indicador de fim da parede mostra em que ponto acaba uma parede.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>4.</p>
            </td>
            <td><p>O indicador de tamanho final mostra o ponto que pode arrastar para mover o ponto final da parede.</p>
            </td>
          </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Quando o ponteiro do rato est&aacute; no ponto inicial ou final da parede seleccionada, altera a sua forma para indicar que pode 
		   arrastar e largar esse ponto para o mover. Enquanto pressionar o bot&atilde;o do rato, disp&otilde;e de uma caixa que lhe mostra o 
		   comprimento da parede.<br>
		   As paredes modificadas com o rato s&atilde;o desenhadas simultaneamente na planta e na vista 3D. </p>
        <p>Uma parede tamb&eacute;m pode ser editada na sua janela, que surge fazendo duplo clique na parede ou escolhendo <i>Planta &gt; Modificar 
		   paredes...</i> depois de a seleccionar na planta.</p>
        <p align="center"><img src="images/editingWalls.png"></p>
        <p>Na janela de edi&ccedil;&atilde;o de paredes, pode alterar&nbsp;as coordenadas dos seus pontos inicial e final, as cores, textura e
		   brilho dos seus lados direito e esquerdo, o padr&atilde;o usado para o preenchimento na planta, a cor usada para pintar o seu topo na 
		   vista 3D, a sua espessura, a sua altura e a extens&atilde;o do seu arco se for uma parede redonda. Tamb&eacute;m pode adicionar 
		   (ou remover) rodap&eacute;s no fundo de cada lado, clicando nos bot&otilde;es <i>Modificar rodap&eacute;</i>.<br>
           Se for uma parede inclinada de um s&oacute;t&atilde;o, escolha uma altura diferente para os pontos inicial e final, e assegure-se que o 
		   bot&atilde;o r&aacute;dio <b>Parede inclinada</b> est&aacute; seleccionado.<br>
           Use os indicadores de in&iacute;cio e fim de parede desenhados na planta em cada parede seleccionada para distinguir o lado esquerdo do 
		   lado direito.</p>
      </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td width="16">
              <p>&#149;</p>
            </td>
            <td>
              <p>Se quer modificar as cores, as texturas, a espessura ou a altura de um conjunto de paredes, seleccione-as e escolha <i>Planta &gt; 
			     Modificar paredes...</i>. Os valores dos atributos que forem diferentes de uma parede para a outra no conjunto seleccionado, deixam 
				 os campos respetivos na janela de edi&ccedil;&atilde;o de paredes em branco. Se entre estas paredes houver uma que n&atilde;o 
				 esteja correctamente orientada, seleccione-a e escolha <i>Planta &gt; Inverter direc&ccedil;&atilde;o da parede</i>.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se quer definir cores ou texturas diferente no lado de uma parede partilhada por divis&otilde;es adjacentes, divida-a em 
			     m&uacute;ltiplos segmentos na altura da sua <a href="drawingWalls.html">cria&ccedil;&atilde;o</a>. Ap&oacute;s a cria&ccedil;&atilde;o, 
				 tamb&eacute;m pode dividir uma parede em duas escolhendo <i>Planta &gt; Dividir parede</i>. Se quer alterar a cor de todos os lados das 
				 paredes &agrave; volta da divis&atilde;o, <a href="drawingRooms.html">desenhe essa divis&atilde;o</a> se necess&aacute;rio, e 
				 seleccione a cor que quiser na sec&ccedil;&atilde;o <i>Lados das paredes &agrave; volta da sala</i> da janela 
				 <a href="editingRooms.html">Modifica&ccedil;&atilde;o</a> dessa divis&atilde;o. Tamb&eacute;m pode definir todos os rodap&eacute;s &agrave;
				 volta de uma divis&atilde;o usando a sec&ccedil;&atilde;o <i>Rodap&eacute; dos lados da parede</i> no painel de 
				 <a href="editingRooms.html">modifica&ccedil;&atilde;o</a> dessa divis&atilde;o.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se n&atilde;o quer calcular &agrave; m&atilde;o o comprimento de uma parede de acordo com as suas coordenadas, use o campo 
			     <i>Comprimento no final</i>. Qualquer altera&ccedil;&atilde;o do seu valor calcula automaticamente as coordenadas X e Y do ponto
				 final da parede e vice-versa.</p>
            </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Para o ajudar a manter as paredes paralelas, o &acirc;ngulo de uma parede modificada com o rato &eacute;, por predefini&ccedil;&atilde;o,
			     um m&uacute;ltiplo de 15&deg;. Pode desativar o magnetismo nas <a href="editingPreferences.html">prefer&ecirc;ncias</a> ou, durante 
				 o movimento do rato, mantendo pressionada a tecla <i>Alt</i> no Windows, <i>cmd</i> em Mac OS X ou <i>Shift</i> +<i> Alt</i> em Linux.</p>
            </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se os objectos seleccionados na planta cont&ecirc;m paredes, divis&otilde;es, mob&iacute;lia ou cotas e textos, todos estes objectos 
			     ser&atilde;o movidos numa opera&ccedil;&atilde;o de arrastar e largar ou numa movimenta&ccedil;&atilde;o com as setas do teclado.
				 Se mantiver pressionada a tecla <i>Ctrl</i> (ou <i>alt</i> em  Mac OS X) enquanto arrasta e larga estes objectos, eles ser&atilde;o 
				 duplicados.
			</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>As unidades mostradas nas sugest&otilde;es e na janela de edi&ccedil;&atilde;o de paredes s&atilde;o, por predefini&ccedil;&atilde;o, 
			     as do seu pa&iacute;s. Pode usar mil&iacute;metros, cent&iacute;metros, metros ou polegadas. Escolha-as nas <a href="editingPreferences.html">
				 prefer&ecirc;ncias</a>.  
			</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
              <td> <p>Escolha <i>Planta &gt; Ampliar</i> ou <i>Planta &gt; Reduzir</i> para alterar a escala da planta, ou use a roda do rato enquanto
				      mant&eacute;m premida a tecla <i>Ctrl</i> (ou <i>cmd</i> em Mac OS X).
			  </td>
          </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
