<html lang="pt">
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Editar divis&otilde;es</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocEditing.html">Editar
										   prefer&ecirc;ncias, planta e vista 3D</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Editar divis&otilde;es</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Pode editar a localiza&ccedil;&atilde;o das divis&otilde;es com o rato, depois de as seleccionar na planta.<br>
		   Clique numa divis&atilde;o na planta para a seleccionar. Para seleccionar m&uacute;ltiplas divis&otilde;es ou objectos, desenhe
		   uma selec&ccedil;&atilde;o rectangular &agrave; volta deles ou clique nos objectos enquanto mant&eacute;m pressionada a tecla <i>shift</i>.<br>
           Para mover os objectos seleccionados, coloque o ponteiro do rato dentro da selec&ccedil;&atilde;o e arraste-os e largue-os ou use as
		   setas no teclado. Note que uma divis&atilde;o nunca est&aacute; ligada &agrave;s paredes, janelas e portas &agrave; volta dela, por isso
		   ter&aacute; que seleccionar uma divis&atilde;o com estes objectos para os mover a todos.</p>
        <p>Quando <b>uma</b> divis&atilde;o estiver seleccionada na planta, pode mover qualquer um dos seus pontos com os indicadores que aparecem
		   em cada ponto da divis&atilde;o seleccionada. Pode tamb&eacute;m mover o texto com o seu nome e o que mostra a &aacute;rea, se estiver 
		   vis&iacute;vel.</p>
        <p align="center"><img src="../images/roomPoints.png" alt="Room points" width="306" height="378"></p>
    </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td nowrap><p>1. 2...</p>
            </td>
            <td><p>O indicador de ponto mostra o ponto que pode arrastar para mover um ponto da divis&atilde;o.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>3.</p>
            </td>
            <td><p>O indicador de nome mostra o ponto que pode arrastar para mover um nome da divis&atilde;o.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>4.</p>
            </td>
            <td><p>O indicador de &aacute;rea mostra o ponto que pode arrastar para mover uma &aacute;rea da divis&atilde;o.</p>
            </td>
          </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Quando o ponteiro do rato est&aacute; em cima destes indicadores, a sua forma altera-se para indicar que pode arrastar e largar esse 
		   ponto ou texto para o mover. Enquanto pressiona o bot&atilde;o do rato, as linhas de alinhamento e o magnetismo (se activado) ajudam-no 
		   a encontrar um canto de uma divis&atilde;o ou outra localiza&ccedil;&atilde;o.<br>
           As divis&otilde;es modificadas com o rato s&atilde;o desenhadas simultaneamente na planta e na vista 3D.</p>
        <p>Pode tamb&eacute;m editar o nome e os atributos 3D de uma divis&atilde;o na sua pr&oacute;pria janela. Fa&ccedil;a duplo clique numa 
		   divis&atilde;o na planta ou escolha <i>Planya &gt; Modificar divis&otilde;es...</i> depois de a seleccionar.</p>
        <p align="center"><img src="images/editingRooms.png"></p>
        <p>Na janela de edi&ccedil;&atilde;o de divis&otilde;es, pode alterar o nome e definir se a &aacute;rea &eacute; mostrada ou n&atilde;o na 
		   planta.<br>
           Pode tamb&eacute;m escolher se o ch&atilde;o ou o tecto da divis&atilde;o seleccionada &eacute; mostrado na vista 3D e definir a sua cor, 
		   textura e brilho.<br>
           Quando a divis&atilde;o seleccionada tocar ou estiver muito perto de uma ou mais paredes, a janela de edi&ccedil;&atilde;o mostra 
		   tamb&eacute;m as sec&ccedil;&otilde;es <i>Lados das paredes &agrave; volta da sala</i> e <i>Rodapé dos lados das paredes</i>
		   que lhe permite escolher a cor e/ou textura dos lados das paredes que ficam ao lado ou dentro da divis&atilde;o, assim como o seu rodapé
		   quando a op&ccedil;&atilde;o <i>Adicionar rodap&eacute;</i> estiver marcada. Se necess&aacute;rio, seleccione <i>Recalcular paredes</i> 
		   para dividir automaticamente as paredes que se estendem por outras divis&otilde;es pr&oacute;ximas.</p>
        <table align="center"><tr>
          <td><img src="../images/notRecomputedWallsAroundRoom.png" border="1" ></td>
		  <td>&nbsp;</td>
		  <td><img src="../images/recomputedWallsAroundRoom.png" border="1"></td></tr>
	      <tr><td align="center"><i>Paredes n&atilde;o calculadas</i></td>
	      <td></td>
	      <td align="center"><i>Paredes recalculadas</i></td></tr></table></td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td width="16">
              <p>&#149;</p>
            </td>
            <td>
              <p>Se quer modificar os atributos de um conjunto de divis&otilde;es, seleccione-as e escolha <i>Mob&iacute;lia &gt; Modificar 
			     divis&otilde;es...</i>. Os valores dos atributos que forem diferentes nalgumas divis&otilde;es deixam os campos respetivos da janela 
				 de edi&ccedil;&atilde;o em branco.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se quer definir cores ou texturas diferentes em partes diferentes do ch&atilde;o de uma mesma divis&atilde;o, 
			  <a href="drawingRooms.html">crie</a> uma divis&atilde;o para cada parte e altere a sua cor ou textura.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Pode adicionar um ponto a uma divis&atilde;o existente, pondo o cursor do rato onde o novo ponto deve ser adicionado 
				 e escolhendo <i>Adicionar ponto à divisão</i> no menu contextual da planta. Pode igualmente eliminar o ponto
				 de uma divis&atilde;o sob o cursor do rato escolhendo <i>Eliminar ponto da divis&atilde;o</i> no menu contextual da planta.</td>
		  </tr>		 
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>A cota do ch&atilde;o de uma divis&atilde;o &eacute; sempre igual &agrave; cota do <a href="addingLevels.html">piso</a> a que a 
			     divis&atilde;o pertence (i.e. 0 se a casa s&oacute; tem um piso). Se a divis&atilde;o n&atilde;o estiver no <b>&uacute;ltimo piso</b>, a cota do tecto
				 ser&aacute; igual &agrave; cota actual + a altura do piso a que pertence. De outra forma, a altura do tecto de uma divis&atilde;o &eacute;
				 calculada em cada ponto da divis&atilde;o, e a altura em cada um destes pontos &eacute; igual &agrave; altura do ponto mais pr&oacute;ximo
				 da parede. Isto permite criar o tecto de um sot&atilde;o quando define alturas diferentes nos pontos inicial e final de uma
				 <a href="editingWalls.html">parede inclinada</a>. Quando a opção <i>Tecto sempre plano</i> está seleccionada, o tecto é sempre plano e colocado 
				 na elevação da parede mais alta do nível. Desmarque esta opção para experimentar o tecto de um sótão (funciona apenas para salas com uma forma simples).</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>O tecto de uma divis&atilde;o s&oacute; &eacute; vis&iacute;vel de baixo, i.e. s&oacute; o ver&aacute; quando o modo 
			  <a href="editing3DView.html">Visitante virtual</a> estiver seleccionado. Isto permite-lhe ver sempre o interior da sua casa quando
			  a <a href="editing3DView.html">Vista a&eacute;rea</a> estiver seleccionada, esteja ou n&atilde;o seleccionada a op&ccedil;&atilde;o
			  <i>Mostrar tecto</i> na janela de edi&ccedil;&atilde;o de divis&otilde;es.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Para o ajudar a manter as paredes paralelas, o &acirc;ngulo de uma parede modificada com o rato &eacute;, por predefini&ccedil;&atilde;o,
			     um m&uacute;ltiplo de 15&deg;. Pode desativar o magnetismo nas <a href="editingPreferences.html">prefer&ecirc;ncias</a> ou, durante 
				 o movimento do rato, mantendo pressionada a tecla <i>Alt</i> no Windows, <i>cmd</i> em Mac OS X ou <i>Shift</i> +<i> Alt</i> em Linux.</p>
            </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se os objectos seleccionados na planta cont&ecirc;m paredes, divis&otilde;es, mob&iacute;lia ou cotas e textos, todos estes objectos 
			     ser&atilde;o movidos numa opera&ccedil;&atilde;o de arrastar e largar ou numa movimenta&ccedil;&atilde;o com as setas do teclado.
				 Se mantiver pressionada a tecla <i>Ctrl</i> (ou <i>alt</i> em  Mac OS X) enquanto arrasta e larga estes objectos, eles ser&atilde;o 
				 duplicados.
			</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>As unidades mostradas nas sugest&otilde;es e na janela de edi&ccedil;&atilde;o de paredes s&atilde;o, por predefini&ccedil;&atilde;o, 
			     as do seu pa&iacute;s. Pode usar mil&iacute;metros, cent&iacute;metros, metros ou polegadas. Escolha-as nas <a href="editingPreferences.html">
				 prefer&ecirc;ncias. Se tiver escolhido Polegadas a &aacute;rea ser&aacute; mostrada em p&eacute;s quadrados sen&atilde;o ser&aacute; 
				 mostrada em metros quadrados.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
              <td> <p>Escolha os itens do menu <i>Planta &gt; Modificar estilo do texto</i> para modificar o tamanho e estilo do tipo de letra
					  usado para o texto do nome e da &aacute;rea das divis&otilde;es.</td>
          </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
