<html>
<head>
<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
<title>Editar polilinhas e curvas</title>
<link href="../help.css" rel="stylesheet" media="all">
</head>

<body bgcolor="#ffffff">
	<div id="banner">
		<div id="helpheader">
			<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> &gt; <a class="bread" href="tocEditing.html">Editar prefer&ecirc;ncias, planta e vista 3D</a>
		</div>
	</div>
	<div id="mainbox" align="left">
		<table border="0" cellpadding="0" cellspacing="0" width="100%">
			<tbody><tr height="32" valign="bottom">
				<td height="32" width="3">&nbsp;</td>
				<td height="32" width="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
				<td height="32" width="8">&nbsp;&nbsp;</td>
				<td height="32" valign="bottom"><font id="topic">Editar polilinhas e curvas</font></td>
			</tr>
			<tr height="10">
				<td colspan="4" height="10">&nbsp;</td>
			</tr>
		</tbody></table>
		<table border="0" cellpadding="3" cellspacing="0" width="100%">
			<tbody><tr>
				<td><p>Pode editar a localiza&ccedil;&atilde;o das polilinhas com o rato, depois de as seleccionar na planta.<br> 
				Para seleccionar&nbsp;uma polilinha na planta, clique-a. Para seleccionar m&uacute;ltiplas polilinhas ou 
				m&uacute;ltiplos objectos na planta, desenhe uma selec&ccedil;&atilde;o rectangular &agrave; volta deles e/ou
				clique-os enquanto prime <i>Shift</i>.<br> Para mover os objectos seleccionados, ponha o cursor do rato dentro 
				da caixa de selec&ccedil;&atilde;o e arraste-os, ou prima as teclas de setas.
				</p>
				<p>Quando <b>uma</b> polilinha est&aacute; seleccionada na planta, pode mover qualquer um dos seus pontos, com 
				os indicadores que aparecem em cada ponto da polilinha seleccionada.
				</p>
				<p align="center"><img src="../images/polylinePoints.png" alt="Polyline points"></p>
				<p>Quando o ponteiro do rato est&aacute; sobre um destes indicadores, muda para lhe mostrar que pode arrastar 
				e largar esse ponto para o mover.<br> A cor e o estilo de uma polilinha tamb&eacute;m podem ser editados 
				gra&ccedil;as ao seu painel, que surge ap&oacute;s um duplo clique na polilinha desejada, ou escolhendo 
				<i>Planta &gt; Modificar polilinhas...</i> depois de a seleccionar.
				</p>
				<p align="center"><img src="images/editingPolylines.png"></p>
				<p>No painel de polilinhas, pode alterar&nbsp;a espessura da polilinha seleccionada, as setas desenhadas nos 
				seus extremos, o estilo de linhas unidas, o estilo do tra&ccedil;o e a sua cor. A &uacute;ltima escolha da 
				lista pendente <i>Estilo de jun&ccedil;&atilde;o</i> permite desenhar uma curva em vez de linhas.</p></td>
			</tr>
		</tbody></table>
		<div id="taskbox">
			<table bgcolor="#eeeeee" border="0" cellpadding="7" cellspacing="0" width="100%">
				<tbody><tr bgcolor="#eeeeee" valign="top">
					<td bgcolor="#eeeeee" width="98%">
						<table border="0" cellpadding="4" cellspacing="0">
							<tbody><tr valign="top">
								<td width="16">
									<p>&#149;</p>
								</td>
								<td>
									<p>Se quiser modificar o estilo de un conjunto de polilinhas, seleccione-as e escolha
									<i>Planta &gt; Modificar polilinhas...</i>. Os valores dos atributos que s&atilde;o diferentes 
									de uma polilinha para outra no conjunto seleccionado, aparecem em branco no painel de 
									polilinhas. Tamb&eacute;m pode copiar o estilo de uma polilinha para outras polilinhas, 
									copiando-o para a &aacute;rea de transfer&ecirc;ncia com <i>Editar &gt; Copiar</i>, e depois escolhendo 
									<i>Editar &gt; Colar estilo</i> ap&oacute;s seleccionar as polilinhas que quer modificar.
							  </p></td>
							</tr>
							<tr valign="top">
								<td>
									<p>&#149;</p>
								</td>
								<td>
									<p>Se quiser desativar o magnetismo dos &acirc;ngulos das linhas que desenhar, fa&ccedil;a-o 
									no painel de <a href="editingPreferences.html">prefer&ecirc;ncias</a> ou enquanto move pontos, 
									mantendo <i>Alt</i> premida em Windows, <i>cmd</i> em Mac OS X ou <i>Shift</i> +<i> Alt</i> 
									em Linux.
								</p>
								</td>
							</tr>
							<tr valign="top">
								<td>
									<p>&#149;</p>
								</td>
								<td>
									<p>Se os objectos seleccionados na planta cont&ecirc;m paredes, divis&otilde;es, mob&iacute;lia, 
									cotas, polilinhas e textos, todos eles ser&atilde;o movidos com um arrastar/largar ou com 
									as teclas de setas. Se mantiver <i>Ctrl</i> premida (ou em Mac OS X, <i>alt</i>) enquanto
									arrasta e larga estes objectos, eles ser&atilde;o duplicados.
								</p></td>
							</tr>
						</tbody></table>
					</td>
				</tr>
			</tbody></table>
		</div>
	</div>
</body>
</html>
