<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Editar pisos</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocEditing.html">Editar
					      prefer&ecirc;ncias, plantas e vista 3D</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Editar pisos</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Pode editar a visibilidade, o nome, a cota e as alturas de um piso fazendo duplo clique no seu separador, ou escolhendo <i>Planta &gt; Pisos &gt; Modificar piso</i>...<br>
      A janela de modifica&ccedil;&atilde;o de um piso permite-lhe editar os seus atributos, mas tamb&eacute;m mostra uma tabela 
      descrevendo todos os pisos de uma casa onde a linha seleccionada corresponde ao piso actualmente em edi&ccedil;&atilde;o.</p>
<p align="center"><img src="images/editingLevels.png" alt="Modify level"></p>
	    <p>A espessura do ch&atilde;o &eacute; usada para calcular o contorno vertical &agrave; volta de um ch&atilde;o na vista 3D. Esta 
		superf&iacute;cie &eacute; vis&iacute;vel &agrave; volta de aberturas no ch&atilde;o e no contorno de uma varanda ou mezanino (ou sobreloja).<br>
	      A cota de um piso pode ser positiva ou negativa. No &uacute;ltimo caso, o solo ser&aacute; automaticamente cavado na vista 3D de cada vez 
		  que uma pe&ccedil;a de mobili&aacute;rio, divis&atilde;o ou um conjunto fechado de paredes seja adicionado ao subsolo. Esta funcionalidade 
		  pode ser usada para colocar uma piscina no solo ou para criar uma cave com um ou mais pisos.</p></td>
	</tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td> N&atilde;o &eacute; obrigat&oacute;rio introduzir valores que tenham o efeito de superimpor pisos em cima uns dos outros. Pode 
			usar a funcionalidade dos pisos para gerir pisos interm&eacute;dios, pisos sobre-elevados e tectos falsos. Tamb&eacute;m pode usar pisos 
			na mesma cota como camadas para isolar alguns objectos como <a href="drawingDimensions.html">linhas de dimens&atilde;o</a> ou 
			<a href="addingTexts.html">textos</a>.</td>
          </tr>
            <tr valign="top"> 
              <td width="16"> <p>&#149;</p></td>
              <td> <p>Os separadores no topo da vista de planta mostram o nome dos pisos por ordem de cota e, dentro da mesma cota, pela ordem 
			  inversa em que s&atilde;o citados na tabela <i>Resumo de pisos</i>. Use as setas &agrave; direita da tabela
			  para alterar a ordem do piso editado.</td>
            </tr>
          </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
