<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Importar mob&iacute;lia</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocImporting.html">Importar fundo e mob&iacute;lia</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Importar mob&iacute;lia</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Para importar um modelo 3D para o cat&aacute;logo de mob&iacute;lia e/ou a planta, escolha <i>Mob&iacute;lia &gt; Importar mob&iacute;lia.
		   .. </i> ou arraste e largue um ficheiro de modelo 3D numa janela do Sweet Home 3D.<br>
		   Estas opera&ccedil;&otilde;es abrem um Assistente que o ajuda a escolher um ficheiro de modelo 3D e a definir as suas 
		   caracter&iacute;sticas em poucos passos. </p>
        <table border="0" align="center" cellpadding="0" cellspacing="5">
          <tr>
            <td><img src="../images/importingFurnitureStep1.png" alt="Step 1" width="250" height="199"></td>
            <td><img src="../images/importingFurnitureStep2.png" alt="Step 2" width="250" height="200"></td>
          </tr>
          <tr>
            <td><img src="../images/importingFurnitureStep3.png" alt="Step 3" width="250" height="200"></td>
            <td><img src="../images/importingFurnitureStep4.png" alt="Step 4" width="250" height="200"></td>
          </tr>
        </table>        
    </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td nowrap><p>1.</p>
            </td>
            <td><p>Se iniciou o Assistente com <i>Mob&iacute;lia &gt; Importar mob&iacute;lia...</i>, escolha um ficheiro com o formato OBJ, DAE,
				   KMZ ou 3DS  ou um ficheiro ZIP que contenha ficheiros destes tipos e clique em <b>Escolher modelo</b>.<br>
				   Uma vez o modelo carregado, clique em <b>Continuar</b>.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>2.</p>
            </td>
            <td><p>Oriente o modelo com os bot&otilde;es de <b>setas</b> de forma a que a vista frontal mostre a frente da pe&ccedil;a. Por vezes 
			       alguns modelos 3D s&atilde;o incorrectamente interpretados e as faces frontais est&atilde;o invertidas. Se for este o caso, marque
				   a caixa <i>Inverter faces frontal e traseira</i>.<br>
                   Clique em <b>Continuar</b>.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>3.</p>
            </td>
            <td><p>Altere, se necess&aacute;rio, o nome, tamanho, cota, cor do modelo importado, se &eacute; m&oacute;vel ou n&atilde;o e se &eacute;
				   uma porta, uma janela<i></i> ou uma escada.<br>
                   Quando importar um modelo para a lista de mob&iacute;lia da casa ou para a planta, marque a caixa <i>Adicionar ao 
				   cat&aacute;logo</i> para import&aacute;-lo tamb&eacute;m para o seu cat&aacute;logo de mob&iacute;lia.<br>
                   Desmarque a caixa <i>Manter propor&ccedil;&otilde;es</i> se quer alterar a largura, profundidade ou altura do modelo 3D 
				   separadamente.<br>
				   Clique em <b>Limpar cor</b> se preferir manter as cores predefinidas do modelo 3D, depois de as ter alterado.<br>
                   A seguir clique em <b>Continuar</b>.            </p>
              </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>4.</p>
            </td>
            <td><p>Gire o modelo 3D com o rato para obter o melhor ponto de vista do modelo para o &iacute;cone mostrado no cat&aacute;logo de 
			       mob&iacute;lia, lista de mob&iacute;lia e planta da casa. Clique em <b>Terminar</b>.</p>
            </td>
          </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Quando fechar o Assistente de importa&ccedil;&atilde;o, o modelo importado surge no cat&aacute;logo de mob&iacute;lia e/ou na planta da 
		   casa e lista de mob&iacute;lia, dependendo da op&ccedil;&atilde;o que escolher.<br>
           Pode <a href="editingFurniture.html">edit&aacute;-lo</a> na planta como qualquer outra pe&ccedil;a de mobili&aacute;rio adicionada do
		   cat&aacute;logo pr&eacute; definido.<br>
           O nome da mob&iacute;lia importada aparece em it&aacute;lico no cat&aacute;logo. Para editar as caracter&iacute;sticas de um modelo
           importado com o Assistente, fa&ccedil;a duplo clique no modelo, ou seleccione-o e escolha <i>Mob&iacute;lia &gt; Modificar...</i>.<br>
        </p>
      </td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td width="16">
              <p>&#149;</p>
            </td>
            <td>
              <p>Importar um modelo 3D arrastando e largando o seu ficheiro numa janela do Sweet Home 3D pode n&atilde;o ser poss&iacute;vel em Linux.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>Se precisar de rodar um modelo 3D em passos de 1&deg; em vez de 90&deg;, mantenha a tecla <i>Shift</i> pressionada enquanto clica
			       nos bot&otilde;es de <b>setas</b> no passo 2.</td>
          </tr>
		  <tr valign="top">
		    <td>
		      <p>&#149;</p>
		      </td>
		    <td>
		      <p>O campo <i> Categoria</i> na lista pendente &eacute; edit&aacute;vel, para o caso de precisar de criar uma nova categoria de mob&iacute;lia.</td>
		    </tr>
		  <tr valign="top">
		    <td><p>&#149;</p></td>
		    <td><p>Quando o magnetismo est&aacute; ativo, s&oacute; portas ou janelas podem ser colocadas numa parede com o rato, e s&oacute; este tipo de
			       mob&iacute;lia &eacute; capaz de criar aberturas nas paredes.<br>
				   Portanto, n&atilde;o se esque&ccedil;a de marcar a caixa <i>Porta ou janela</i> se quer que um modelo 3D importado se comporte como tal.</td>
		    </tr>
		  <tr valign="top">
		    <td><p>&#149;</p></td>
		    <td><p>S&oacute; as escadas s&atilde;o capazes de fazer automaticamente uma abertura no tecto e no ch&atilde;o dos pisos superiores.<br>
				   Portanto, n&atilde;o se esque&ccedil;a de marcar a caixa <i>Escadas</i> se quer que um modelo 3D importado se comporte como tal.
		    </tr>
		  <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Importar um modelo 3D para o cat&aacute;logo de mob&iacute;lia <b>ou</b> para a casa depende de o foco estar ou n&atilde;o no 
			     cat&aacute;logo quando escolhe <i>Mob&iacute;lia &gt; Importar mob&iacute;lia...</i>. Se a lista de mob&iacute;lia, a planta da
				 casa ou a vista 3D tiverem o foco quando escolhe esta op&ccedil;&atilde;o de menu, o modelo importado s&oacute; aparece no 
				 cat&aacute;logo se marcar a caixa <i>Adicionar ao cat&aacute;logo</i>, no passo 3 do Assistente de importa&ccedil;&atilde;o.</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>As unidades mostradas no Assistente de importa&ccedil;&atilde;o s&atilde;o, por predefini&ccedil;&atilde;o, as do seu pa&iacute;s. 
			  Pode usar mil&iacute;metros, cent&iacute;metros, metros ou polegadas. Escolha-as nas 
			  <a href="editingPreferences.html">prefer&ecirc;ncias</a>.        
			</td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Como o cat&aacute;logo de mob&iacute;lia &eacute; partilhado por todas as janelas do Sweet Home 3D windows, nenhuma opera&ccedil;&atilde;o
			     efetuada no cat&aacute;logo (i.e. importa&ccedil;&otilde;es, modifica&ccedil;&otilde;es e remo&ccedil;&otilde;es) pode ser desfeita. </td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>As caracter&iacute;sticas do cat&aacute;logo de mob&iacute;lia importado s&atilde;o gravadas automaticamente nas prefer&ecirc;ncias e
				   os seus ficheiros de modelos 3D e &iacute;cones s&atilde;o gravados em pastas espec&iacute;ficas do Sweet Home 3D.</td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>A op&ccedil;&atilde;o <i>Mob&iacute;lia &gt; Importar biblioteca de mob&iacute;lia...</i> permite-lhe tamb&eacute;m importar bibliotecas
				   de mob&iacute;lia pr&eacute;-configurada armazenadas em ficheiros SH3F e dispon&iacute;veis na p&aacute;gina Web do 
				   <a href="http://www.sweethome3d.com/importModels.html">Sweet Home 3D</a>.</p></td></center>
		  </tr>
        </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
