<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Imprimir uma casa</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocCreating.html">Criar
						      casas, paredes e mob&iacute;lia</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Imprimir uma casa</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Para imprimir uma casa, escolha <i>Ficheiro &gt; Imprimir...</i>.<br>
      Este comando abre a caixa de di&aacute;logo de impress&atilde;o do sistema e permite-lhe escolher a impressora, n&uacute;meros de p&aacute;ginas 
	  imprimidos, qualidade da impress&atilde;o, etc...</p>
      <p>Por predefini&ccedil;&atilde;o, o Sweet Home 3D imprime a lista de mob&iacute;lia, a planta e a vista 3D actual de uma casa, usando o 
	  tamanho de papel, margens e orienta&ccedil;&atilde;o predefinidos.<br>
      Se quiser modificar estes par&acirc;metros, escolha <i>Ficheiro &gt; Configurar p&aacute;gina...</i>.</p>
      <p align="center"><img src="images/pageSetup.png" alt="Page setup"></p>
      <p>          Na janela de configura&ccedil;&atilde;o da p&aacute;gina, pode alterar o tamanho e a orienta&ccedil;&atilde;o do papel 
	  clicando em <i>Formato da p&aacute;gina</i>. Pode tamb&eacute;m escolher se a lista de mob&iacute;lia, a planta e a vista 3D de uma casa devem
	  ser imprimidas ou n&atilde;o. Se n&atilde;o quiser usar o ajuste autom&aacute;tico da escala ao tamanho do papel, pode escolher outra escala no
	  campo <i>Escala</i>.<br>
      Tamb&eacute;m pode escolher o cabe&ccedil;alho e o rodap&eacute; que v&atilde;o aparecer em cada uma das p&aacute;ginas imprimidas. Os campos
	  <i> Cabe&ccedil;alho</i> e <i>Rodap&eacute; </i>aceitam texto livre e algumas vari&aacute;veis que ser&atilde;o substitu&iacute;das aquando da 
	  impress&atilde;o. Estas s&atilde;o as 8 vari&aacute;veis dispon&iacute;veis por enquanto:</p>
      <ul>
        <li><i>$pageNumber</i> para o n&uacute;mero da p&aacute;gina;</li>
        <li><i>$pageCount</i> para o n&uacute;mero total de p&aacute;ginas;</li>
        <li><i>$pageScale</i> para a escala da planta (ou a calculada automaticamente ou a que introduziu no campo <i>Escala</i>);</li>
        <li><i>$date</i> para a data de impress&atilde;o;</li>
        <li><i>$time</i> para a hora de impress&atilde;o;</li>
        <li><i>$name</i> para o nome da sua casa;</li>
        <li><i>$file</i> para o caminho do ficheiro da sua casa.</li>
        <li><i>$level</i> para o nome do piso imprimido.</li>
      </ul>      
      <p>Para evitar ter de escrever o nome exato das vari&aacute;veis, use os bot&otilde;es <i>Vari&aacute;veis</i>  mostrados abaixo dos campos
	  <i>Cabe&ccedil;alho</i> e <i>Rodap&eacute; </i>. Como o sinal "$" &eacute; reservado para vari&aacute;veis, deve usar o c&oacute;digo "$$" para
	  imprimir um "$".</p>      
      <p>Antes de imprimir a sua casa, pode pr&eacute;-visualiz&aacute;-la no ecr&atilde;, escolhendo <i>Ficheiro &gt; Pr&eacute;-visualizar...</i>.</p>
      <p align="center"><img src="images/printPreview.png" alt="Print preview"></p>
      <p>Na janela de pr&eacute;-visualiza&ccedil;&atilde;o, pode ver como uma casa vai ser imprimida, p&aacute;gina por p&aacute;gina. Para mudar
	  a p&aacute;gina pr&eacute;-visualizada, clique nas setas no topo da janela ou use as setas do teclado.</p></td>
  </tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td width="16"><p>&#149;</p>
            </td>
            <td>
              <p>A impress&atilde;o pode n&atilde;o funcionar em Linux. Se for este o caso, por favor escolha <i>Ficheiro &gt; Imprimir para PDF...</i>
			  e imprima o ficheiro PDF com as ferramentas do seu sistema.</p>
            </td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p>
            </td>
            <td>
              <p>A impress&atilde;o da vista 3D pode n&atilde;o estar dispon&iacute;vel devido a uma configura&ccedil;&atilde;o limitada do seu 
			  sistema. Nesse caso, a caixa <i>Imprimir vista 3D</i> estar&aacute; desmarcada e desactivada.</p>
            </td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>Se a casa a imprimir contiver mais de um <a href="addingLevels.html">piso</a>, a lista de mob&iacute;lia a imprimir conter&aacute; apenas
			a mob&iacute;lia vis&iacute;vel no piso actualmente seleccionado, exceto se requerer a impress&atilde;o s&oacute; da lista de mob&iacute;lia, caso 
			em que toda a lista de mob&iacute;lia ser&aacute; imprimida. A planta imprimida e a vista 3D ser&atilde;o as que est&atilde;o actualmente mostradas no 
			ecr&atilde;.</p></td>
          </tr>
          <tr valign="top">
            <td width="16"><p>&#149;</p>
            </td>
            <td>
              <p>A vista 3D de uma casa &eacute; sempre imprimida com uma resolu&ccedil;&atilde;o de 150 dpi e de maneira a encher uma p&aacute;gina, 
			  exceto as margens.</p>
            </td>
          </tr>
          <!-- Note to translators: the content of the following <tr> element should be translated only 
             if users speaking your language actually use imperial system units (i.e. foot/inch). Otherwise, it can be ignored. -->
		  <tr valign="top">
			<td><p>&#149;</p></td>
			<td><p>Use estas instru&ccedil;&otilde;es se n&atilde;o sabe como converter uma escala da forma <i>1/4&quot;=1'</i> para o valor esperado
			no campo <i>Escala</i> na janela Configurar p&aacute;gina: uma escala <i>1/x </i> diz-nos a quanto &eacute; que uma unidade no papel 
			corresponde na vida real, tanto como uma escala <i>1/4&quot;=1'</i> nos diz que 1/4 de polegada no papel corresponde a 1 p&eacute; na vida real. 
			Assim, uma escala <i>1/100</i> significa que 1&nbsp;cm no papel corresponde a 100 cm i.e. 1 m na vida real. Para converter uma escala 
			<i>1/4&quot;=1'</i> onde o valor &agrave; esquerda do sinal n&atilde;o &eacute; 1 e/ou n&atilde;o usa a mesma unidade que o valor &agrave; 
			direita do sinal de igual, converta os dois valores na unidade mais pequena, e divida o valor &agrave; direita pelo valor &agrave; 
			esquerda. Para uma escala <i>1/4&quot; = 1'</i>, converter para polegadas dar&aacute; 1/4&quot;=12&quot;; dividindo 12 por 1/4 d&aacute;
			48, ou seja uma escala equivalente de <i>1/48</i>.</td>
		  </tr>
		  <tr valign="top">
            <td><p>&#149;</p>
            </td>
            <td>
              <p>Tamb&eacute;m pode mostrar a escala numa planta desenhando uma <a href="drawingDimensions.html">dimens&atilde;o</a> com um tamanho padr&atilde;o
			   (1 metro por exemplo).</p>
            </td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p>
            </td>
            <td>
              <p>A configura&ccedil;&atilde;o da p&aacute;gina que escolheu &eacute; <a href="savingHome.html">gravada</a> com o ficheiro da casa.</p>
            </td>
          </tr>
          <tr valign="top">
            <td width="16"><p>&#149;</p>
            </td>
            <td>
              <p>A janela de pr&eacute;-visualiza&ccedil;&atilde;o pode ser ampliada.</p>
            </td>
          </tr>
        </table>
        </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
