<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Desenhar paredes</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home</a> > <a class="bread" href="tocCreating.html">Criar casas, paredes e
										   mob&iacute;lia</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="&Iacutecone do Sweet Home 3D" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Desenhar paredes</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Para desenhar paredes, escolha <i>Planta &gt; Criar paredes</i> ou seleccione a ferramenta 
		   <img src="../images/createWallsTool.png" alt="Ferramenta de cria&ccedil;&atilde;o de paredes" width="24" height="24" align="absmiddle">&nbsp;<i>Criar 
	        paredes</i>.</p>
	    </blockquote>	  
	    <p>Clique na planta da casa no ponto inicial da nova parede, clique ou fa&ccedil;a duplo clique no segundo ponto. Enquanto n&atilde;o fizer
		   duplo clique ou pressionar <i>Esc</i>, cada novo clique indica o ponto oposto da parede actual e o ponto inicial de outra parede. Enquanto 
		   desenha um conjunto de paredes, o ponto inicial da primeira parede ser&aacute; ligado a um ponto inicial ou final de uma parede existente, 
		   se clicar nesse ponto, e a &uacute;ltima parede ser&aacute; ligada ao ponto inicial ou final de outra parede se fizer duplo clique nesse 
		   ponto. Se mantiver pressionada a tecla <i>Ctrl</i> (ou <i>alt</i> em Mac OS X) quando clica no ponto final de uma parede, ser&aacute; 
		   criada uma parede redonda e a extens&atilde;o do seu arco depender&aacute; do ponto onde clicar a terceira vez.<br>
           Os pontos clicados s&atilde;o o centro da espessura das novas paredes; a espessura e altura das novas paredes pode ser alterada nas
           <a href="editingPreferences.html">prefer&ecirc;ncias</a>.<br>
           Se j&aacute; <a href="drawingRooms.html">desenhou uma divis&atilde;o</a>, pode tamb&eacute;m criar as paredes &agrave; volta dela fazendo
		   duplo clique nessa divis&atilde;o. <br>
           As paredes s&atilde;o desenhadas em simult&acirc;neo na planta e na vista 3D. </p>
	  <p align="center"><img src="images/drawingWalls.png" alt="Desenhar paredes" width="349" height="174"></p>	  
	  <p>Para terminar a cria&ccedil;&atilde;o de paredes, escolha <i>Planta &gt; Seleccionar </i> ou seleccione a ferramenta 
	     <img src="../images/selectTool.png" alt="Ferramenta Seleccionar" width="24" height="24" align="absmiddle">&nbsp;<i>Seleccionar</i> novamente.</p>
    </td>
	</tr>
</table>
<div id="taskbox">
<table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
	<tr valign="top" BGCOLOR="#eeeeee">
	<td bgcolor="#eeeeee" width="98%">
	<table border="0" cellspacing="0" cellpadding="4">
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Se tiver dispon&iacute;vel uma imagem digitalizada da sua casa, importe-a como <a href="importingBackground.html">imagem de fundo da planta</a>
		     primeiro. Esta funcionalidade acelera a cria&ccedil;&atilde;o das paredes.</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Para o ajudar a desenhar as paredes com precis&atilde;o, use as sugest&otilde;es e as linhas de alinhamento. Se pressionar <i>Enter</i>
		     com o foco na planta, os valores mostrados na caixa tornam-se edit&aacute;veis, permitindo-lhe introduzir o comprimento, o &acirc;ngulo
			 e a espessura da nova parede atrav&eacute;s do teclado (se ainda n&atilde;o come&ccedil;ou nenhuma parede, a caixa mostra as coordenadas do 
			 ponto inicial da nova parede). Use as setas <i>para cima</i>, <i>para baixo</i> ou a tecla <i>Tab</i> para editar os valores e pressione
			 <i>Enter</i> para confirmar os valores introduzidos. Se quiser usar novamente o rato para desenhar paredes, simplesmente mova-o sobre a 
			 planta.</p>
        </td>
	    </tr>
	  <tr valign="top">
	    <td>
	      <p>&#149;</p>
	      </td>
	    <td>
	      <p>Para o ajudar a desenhar paredes paralelas, o &acirc;ngulo entre paredes &eacute;, por predefini&ccedil;&atilde;o, um m&uacute;ltiplo 
		  de 15&deg;. Pode cancelar este magnetismo nas <a href="editingPreferences.html">prefer&ecirc;ncias</a>, ou mantendo pressionada a tecla 
		  <i>Alt</i> no Windows, <i>cmd</i> em Mac OS X ou <i>Shift</i> +<i> Alt</i> em Linux.</p>
	      </td>
	    </tr>
	  <tr valign="top">
	    <td>
	      <p>&#149;</p>
	      </td>
	    <td>
          <p>O valor predefinido para a altura das paredes &eacute; definido no campo <i>Altura das novas paredes</i>  e a espessura das novas 
		     paredes &eacute; definida no campo <i>Espessura das novas paredes</i>, ambos nas 
			 <a href="editingPreferences.html">prefer&ecirc;ncias</a>.</td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Uma vez criada a parede, pode <a href="editingWalls.html">alterar</a> a sua localiza&ccedil;&atilde;o, o seu comprimento, a sua 
		     espessura, altura, cor, textura e brilho.</p>
        </td>
	    </tr>
	   <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>Se quiser criar um pol&iacute;gono no Sweet Home 3D (por exemplo, uma parede inclinada numa chamin&eacute;), pode seguir estes passos:</p>
				<ol>
					<li>num novo documento, crie um novo n&iacute;vel, cota zero (poder&aacute; alterar depois) e com a espessura e altura da parede a criar;</li>
					<li>seleccione a ferramenta de cria&ccedil;&atilde;o de divisões&nbsp;&nbsp;<img src="../images/createRoomsTool.png" alt="Ferramenta de cria&ccedil;&atilde;o de divis&otilde;es" width="24" height="24" align="absmiddle">&nbsp;<i>Criar 
	        divis&otilde;es</i>&nbsp; e desenhe o pol&iacute;gono que quiser;</li>
					<li>mantenha a divis&atilde;o seleccionada, escolha <i>Vista 3D > Exportar para formato OBJ</i> e escolha <i>Exportar selec&ccedil;&atilde;o</i>;</li>
					<li>no documento onde precisa do pol&iacute;gono, escolha <i>Mob&iacute;lia > Importar mob&iacute;lia</i>, importe o ficheiro OBJ 
						criado no passo anterior e, no segundo passo do assistente, altere a sua orientação como quiser, mantendo premida a tecla
						<i>Shift</i> para conseguir um ângulo mais preciso;</li>
					<li>Et voilà!</li>
				</ol>
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
        <td>
          <p>As unidades mostradas nas sugest&otilde;es s&atilde;o, por predefini&ccedil;&atilde;o, as do seu pa&iacute;s. Pode usar mil&iacute;metros, 
             cent&iacute;metros, metros ou polegadas. Escolha-as nas <a href="editingPreferences.html">prefer&ecirc;ncias</a>.          
        </td>
	    </tr>
	  <tr valign="top">
        <td>
          <p>&#149;</p>
        </td>
              <td> 
				<p>Escolha <i>Planta &gt; Ampliar</i> ou <i>Planta &gt; Reduzir</i> para alterar a escala da planta, ou use a roda do rato
				   mantendo pressionada a tecla <i>Ctrl</i> (ou <i>cmd</i> em Mac OS X).
			  </td>
	    </tr>
	  <tr valign="top">
	    <td>
	      <p>&#149;</p>
	      </td>
	    <td>
          <p>Use a <a href="editing3DView.html">Vista a&eacute;rea</a> predefinida enquanto desenha novas paredes, obter&aacute; um ponto de vista 
		     da sua casa mais &uacute;til na vista 3D.</p>
	    </td>
	  </tr>
	  <tr valign="top"><td width="16"><p>&#149;</p></td><td>
	<p>Enquanto a ferramenta <i>Criar paredes</i> estiver seleccionada, algumas ferramentas e menus podem estar desactivados. Se precisar dessas, 
	   seleccione a ferramenta <img src="../images/selectTool.png" alt="Ferramenta Seleccionar" width="24" height="24" align="absmiddle">&nbsp;<i>Seleccionar</i> 
	   novamente.</p>
	</td>
	</tr></table>
	 </td>
	</tr>
</table></div>
</div>
</body>

</html>
