<html >
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Editar prefer&ecirc;ncias</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocEditing.html">Editar
										   prefer&ecirc;ncias, planta e vista 3D</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Editar prefer&ecirc;ncias</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Para editar as suas prefer&ecirc;ncias no Sweet Home 3D, escolha <i>Sweet Home 3D &gt; Prefer&ecirc;ncias...</i> em Mac OS X ou 
		   <i>Ficheiro &gt; Prefer&ecirc;ncias...</i> nos outros sistemas.</p>
	    <p align="center"><img src="images/editingPreferences.png"></p>
	    <p>Na janela das prefer&ecirc;ncias, a lista pendente <i>Idioma</i> permite-lhe escolher o idioma usado no ambiente do utilizador do
 		   Sweet Home 3D e o bot&atilde;o &agrave; direita permite-lhe importar mais algumas bibliotecas de idiomas adicionais, com a 
		   extens&atilde;o de ficheiro SH3L.<br>
	       A lista pendente <i>Unidades</i> permite-lhe escolher as unidades mostradas nas r&eacute;guas e grelhas da planta da casa, e para os
	       comprimentos e &aacute;reas. 
        <!-- Note to translators: the end of this paragraph should be translated only 
             if users speaking your language actually use imperial system units (i.e. foot/inch). Otherwise, it can be ignored. 
        <i>Millimeter</i>, <i>Centimeter</i> and <i>Meter</i> units are available 
	    for the metric system, and two units are proposed for  the imperial system&nbsp;: the <i>Foot/Inch/Fraction</i> 
	    unit which displays a length in feet and inches followed by the closest eighth inch fraction, like in 
	    <b>20'10&#8539;&quot;</b>, and the <i>Inch/Decimals</i> unit  which displays lengths only in inches followed 
	    by decimals of an inch, like in <b>250.122&quot;</b>. For areas, the <i>Foot/Inch/Fraction</i>  always 
	    displays the closest value in square feet, whereas the <i>Inch/Decimals</i> unit displays some decimals 
	    when necessary.</p> -->
	    <p>Os bot&otilde;es r&aacute;dio <i>Pastas de categoria</i> e a <i>Lista pesquis&aacute;vel</i> permitem-lhe escolher como deve ser 
		   apresentado o cat&aacute;logo de mob&iacute;lia em cada <a href="ui.html">janela do Sweet Home 3D</a>.</p>
	    <p>A caixa <i>Setas de navega&ccedil;&atilde;o 3D</i> mostra um conjunto de bot&otilde;es que ajudam na 
		   <a href="editing3DView.html">navega&ccedil;&atilde;o na vista 3D</a>.<br>
           Quando ativa, a op&ccedil;&atilde;o <i>Vista a&eacute;rea centrada na selec&ccedil;&atilde;o</i> centra a vista a&eacute;rea 3D nos
           itens seleccionados na planta da casa. Se n&atilde;o houver itens seleccionados ou a op&ccedil;&atilde;o estiver desactivada, roda em
		   torno do centro da casa, que pode variar em fun&ccedil;&atilde;o dos itens que cont&eacute;m.<br>
		   Se activa, a opção <i>Seleccionar visitante na planta ao mover em 3D</i> vai seleccionar e mostrar o visitante virtual desenhado 
		   na planta 2D sempre que faça um movimento na vista 3D no modo <i>Visita virtual</i>. Deve desseleccionar esta opção se não quiser 
		   perder a selecção actual na planta e/ou alterar a parte visível da planta a cada movimento na vista 3D.</p>
        <p>A caixa <i>Magnetismo</i> ativa ou desativa esta op&ccedil;&atilde;o, usada durante o <a href="drawingWalls.html">desenho de paredes</a> 
		   e a <a href="editingFurniture.html">disposi&ccedil;&atilde;o da mob&iacute;lia</a>. O magnetismo também pode ser desactivado/activado com o ícone <i>Íman</i>, 
		   encontrado na barra de ferramentas 3D do Sweet Home.<br>
           A caixa <i>R&eacute;guas</i> permite mostrar ou ocultar as r&eacute;guas &agrave; volta da planta.<br>
           A caixa <i>Grelha</i> permite mostrar ou ocultar a grelha no fundo da planta.<br>
           A lista pendente <i>Letra predefinida</i> permite escolher a letra usada para textos mostrados na planta (i.e. nome de <a href="editingFurniture.html">mob&iacute;lia</a>, 
           nome e &aacute;rea de <a href="editingRooms.html">divis&otilde;es</a>, comprimento de <a href="editingDimensions.html">linhas de cota</a> e 
           letra predefinida de <a href="addingTexts.html">textos livres</a>).<br>
		   Os bot&otilde;es r&aacute;dio <i>Itens do cat&aacute;logo</i> e <i>Vista de cima</i> permitem-lhe escolher como &eacute; que a mob&iacute;lia 
		   &eacute; desenhada na planta (ver imagens abaixo). Quando a opção <i>Vista de topo</i> está seleccionada, a lista pendente <i>Tamanho do ícone</i> 
		   permite-lhe seleccionar o tamanho em pixels dos ícones desenhados na planta 2D. Tamanhos grandes dão bonitas plantas desenhadas no ecrã, 
		   imprimidas e exportadas em formato SVG, mas requerem mais espaço em memória.<br>
           Os bot&otilde;es r&aacute;dio <i>Monocrom&aacute;tico</i> e <i>Cor ou textura do ch&atilde;o</i> permitem-lhe escolher se as divis&otilde;es
		   devem ser desenhadas na planta preenchidas com a cor ou textura que escolheu para o seu ch&atilde;o, ou com cinzento (imprimido a branco).<br>
           A lista pendente <i>Padr&atilde;o das novas paredes na planta</i> permite-lhe escolher o padr&atilde;o de preenchimento das paredes a 
		   criar uma vez fechada esta janela.<br>
           O valor <i>Espessura das novas paredes</i> especifica a espessura das paredes a criar uma vez fechada esta janela.<br>
           O valor <i>Altura das novas paredes</i> especifica a altura das paredes a criar uma vez fechada esta janela.<br>
           O valor <i>Espessura do ch&atilde;o dos novos pisos</i> especifica a espessura do ch&atilde;o dos novos pisos a criar uma vez fechada 
		   esta janela.</p>
        <p>Quando seleccionada, a op&ccedil;&atilde;o <i>Procurar actualiza&ccedil;&otilde;es no in&iacute;cio</i> vai verificar se h&aacute; 
		   actualiza&ccedil;&otilde;es do Sweet Home 3D dispon&iacute;veis sempre que o programa arranca, e mostra-as numa caixa de di&aacute;logo.
		   Esta op&ccedil;&atilde;o tamb&eacute;m testa a disponibilidade de actualiza&ccedil;&otilde;es nas bibliotecas de mob&iacute;lias (ficheiros 
		   SH3F), de texturas (ficheiros SH3T), de idiomas (ficheiros SH3L) e plug-ins (ficheiros SH3P) que tenha instalado, dependendo de como estejam
		   configuradas.</p>	  
        <p>O valor do campo associado &agrave; caixa <i>Gravar casa para recupera&ccedil;&atilde;o</i> define o tempo em minutos entre cada 
		   grava&ccedil;&atilde;o de seguran&ccedil;a dos ficheiros de casas abertos. Estas casas s&atilde;o automaticamente gravadas em ficheiros 
		   privados, que ser&atilde;o usados para recupera&ccedil;&atilde;o de dados no pr&oacute;ximo in&iacute;cio do Sweet Home 3D se o programa 
		   terminar bruscamente (por exemplo, uma falha de energia).<br>
           Finalmente, o bot&atilde;o <i>Limpar as defini&ccedil;&otilde;es de sugest&otilde;es</i> rep&otilde;em as respostas que deu na caixa
		   <i>N&atilde;o mostrar a sugest&atilde;o novamente</i> mostrada nas caixas de di&aacute;logo que surgem quando clica em algumas 
		   ferramentas. Isto significa que todas as sugest&otilde;es e truques v&atilde;o voltar a aparecer.</p>
        <table border="0" align="center" cellpadding="0" cellspacing="5">
        <tr align="center">
          <td><img src="../images/defaultRendering.png" width="332" height="296"></td>
          <td rowspan="2">&nbsp;&nbsp;&nbsp;</td>
          <td><img src="../images/coloredRendering.png" width="332" height="296"></td>
        </tr>
        <tr>
          <td align="center" valign="top">Planta com itens do cat&aacute;logo,<br>
              ch&atilde;os monocrom&aacute;ticos e paredes preenchidas com um padr&atilde;o paralelo</td>
          <td align="center" valign="top">Planta com &iacute;cones de mob&iacute;lia vistos de cima,<br>
            ch&atilde;os com cores, e paredes preenchidas a preto</td>
        </tr>
      </table>	  </td>
	</tr>
</table>
<div id="taskbox">
<table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
	<tr valign="top" BGCOLOR="#eeeeee">
	<td bgcolor="#eeeeee" width="98%">
	<table border="0" cellspacing="0" cellpadding="4">
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td><p>As Prefer&ecirc;ncias s&atilde;o partilhadas por todas as janelas do Sweet Home 3D. Assim, as altera&ccedil;&otilde;es nas 
					 prefer&ecirc;ncias t&ecirc;m efeito em todos os ficheiros de casas abertos.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Quando tem muitas pe&ccedil;as de mobili&aacute;rio no seu cat&aacute;logo de mob&iacute;lia, mostre o cat&aacute;logo como uma
			          lista pesquis&aacute;vel. A sua lista pendente de categorias e a caixa de procura v&atilde;o ajud&aacute;-lo a encontrar 
					  rapidamente as pe&ccedil;as que quer adicionar &agrave; planta da sua casa.</p>
                </td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>Os bot&otilde;es de navega&ccedil;&atilde;o 3D n&atilde;o est&atilde;o dispon&iacute;veis em Mac OS X 10.4 e podem n&atilde;o
					  ser correctamente apresentados em alguns sistemas Linux. Uma vez que se habitue &agrave; 
					  <a href="editing3DView.html">navega&ccedil;&atilde;o na vista 3D com o rato ou o teclado</a>, desmarque esta caixa para 
					  ocultar os bot&otilde;es de navega&ccedil;&atilde;o no canto superior esquerdo da vista 3D.</p></td>
            </tr>
            <tr valign="top"> 
              <td><p>&#149;</p></td>
              <td> <p>&Iacute;cones de mob&iacute;lia vistos de cima podem n&atilde;o estar dispon&iacute;veis devido a limita&ccedil;&otilde;es no seu pr&oacute;prio 
					  sistema. Se for esse o caso, os bot&otilde;es r&aacute;dio <i>Itens do cat&aacute;logo</i> e <i>Vista de cima</i> ser&atilde;o
					  desactivados.</p></td>
            </tr>
            <tr valign="top"> 
              <td width="16"><p>&#149;</p></td>
              <td><p>A defini&ccedil;&atilde;o do Magnetismo pode ser temporariamente mudada  na planta, pressionado a tecla <i>Alt</i> no Windows, 
					 <i>cmd</i> em Mac OS X ou <i>Shift</i> +<i> Alt</i> em Linux.</p></td>
            </tr>
            <tr valign="top">
              <td width="16"><p>&#149;</p></td>
              <td><p>Uma vez criada uma parede, pode <a href="editingWalls.html">alterar</a> a sua espessura, altura e padr&atilde;o, sejam quais 
					 forem os valores que definiu na janela de Prefer&ecirc;ncias.</p></td>
            </tr>
            <tr valign="top"> 
              <td width="16"><p>&#149;</p></td>
              <td><p>Informa&ccedil;&atilde;o sobre as actualiza&ccedil;&otilde;es s&oacute; pode ser encontrada se o seu computador tiver liga&ccedil;&atilde;o 
			         &agrave; Internet. Em caso de d&uacute;vida, clique em <b>Verificar agora</b> para mostrar as actualiza&ccedil;&otilde;es, 
					 ou uma mensagem informando que n&atilde;o existem actualiza&ccedil;&otilde;es dispon&iacute;veis, ou uma mensagem de erro, 
					 informando que foi imposs&iacute;vel ler as actualiza&ccedil;&otilde;es.</p></td>
            </tr>
          </table>
	</td>
	</tr>
</table></div>
</div>
</body>

</html>
