<html>
	<head>
		<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
		<title>Sugest&otilde;es Sweet Home 3D</title>
		<link href="../help.css" rel="stylesheet" media="all">
	</head>

	<body  bgcolor="#ffffff">
		<div id="banner">
			
  <div id="helpheader"> <a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> 
  </div>
		</div>
		
<div id="mainbox" align="left"> 
  <table width="100%" border="0" cellspacing="0" cellpadding="0">
    <tr valign="bottom"> 
      <td width="3">&nbsp;</td>
      <td width="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
      <td width="8"><a name="anchor"></a></td>
      <td valign="bottom"><font id="topic">Sugest&otilde;es</font></td>
    </tr>
    <tr height="10"> 
      <td colspan="4" height="10">&nbsp;</td>
    </tr>
  </table>
  <table width="100%" border="0" cellspacing="0" cellpadding="3">
    <tr> 
      <td> <p>Eis algumas sugest&otilde;es para o ajudar a trabalhar de forma mais r&aacute;pida e inteligente com o Sweet Home 3D. </p>
        <TABLE BORDER="0" CELLSPACING="0" CELLPADDING="4">
          <tr valign="top"> 
            <td colspan="2"> <p><b>Geral</b></p></td>
          </tr>
          <tr valign="top"> 
            <td><p>&#149;</p></td>
            <td> <p>Use os divisores mostrados entre os pain&eacute;is do cat&aacute;logo de mob&iacute;lia, lista de mob&iacute;lia, 
			planta e vista 3D para redimensionar estes pain&eacute;is.</p></td>
          </tr>
          <tr valign="top"> 
            <td><p>&#149;</p></td>
            <td> <p>Para testar as funcionalidades do Sweet Home 3D sem riscos, lembre-se que todas as opera&ccedil;&otilde;es podem ser desfeitas 
			exceto a modifica&ccedil;&atilde;o de <a href="importingFurniture.html">mob&iacute;lia importada</a> para o cat&aacute;logo. </p></td>
          </tr>
          <TR VALIGN="top"> 
            <TD colspan="2"> <P><B>Cat&aacute;logo de mob&iacute;lia</B></P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Para <a href="addingFurniture.html">adicionar</a> mais do que uma pe&ccedil;a de mobili&aacute;rio a uma casa, de uma s&oacute;
			vez, seleccione todas as que quiser no cat&aacute;logo.</P></TD>
          </TR>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Para abrir uma categoria de mob&iacute;lia, fa&ccedil;a duplo clique na categoria. </p></td>
          </tr>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>Para <a href="importingFurniture.html">modificar</a> uma pe&ccedil;a de mobili&aacute;rio importada fa&ccedil;a duplo clique na 
			pe&ccedil;a.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P> Quando tem muitas pe&ccedil;as no seu cat&aacute;logo de mob&iacute;lia, exiba o cat&aacute;logo como 
			<a href="editingPreferences.html">lista pesquis&aacute;vel</a>. A sua lista pendente de categorias e a caixa de procura v&atilde;o 
			ajud&aacute;-lo a encontrar rapidamente as pe&ccedil;as que precisa para adicionar &agrave; sua casa.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <TD colspan="2"> <P><B>Lista de mob&iacute;lia na casa</B></P></TD>
          </TR>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Para ordenar a mob&iacute;lia da casa, clique no t&iacute;tulo da coluna que corresponde ao crit&eacute;rio de 
			ordena&ccedil;&atilde;o. Ao primeiro clique num t&iacute;tulo de coluna, a mob&iacute;lia &eacute; ordenada em ordem ascendente, ao 
			segundo clique por ordem descendente. Ao terceiro clique a mob&iacute;lia &eacute; ordenada por ordem de adi&ccedil;&atilde;o &agrave; casa.</p></td>
          </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Para reordenar as colunas da lista arraste-as pelo t&iacute;tulo da coluna e largue-as pela ordem desejada.</p></td>
          </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Para encontrar onde uma pe&ccedil;a de mobili&aacute;rio est&aacute; colocada dentro da casa, seleccione-a na lista de 
			mob&iacute;lia.</p></td>
          </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Para <a href="editingFurniture.html">modificar</a> uma pe&ccedil;a de mobili&aacute;rio, fa&ccedil;a duplo clique na pe&ccedil;a,
			na lista ou na planta.</p></td>
          </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Para <a href="editingFurniture.html">modificar</a> mais do que uma pe&ccedil;a de mobili&aacute;rio de uma s&oacute; vez,
			seleccione as pe&ccedil;as na lista de mob&iacute;lia ou na planta e escolha <i>Mob&iacute;lia &gt; Modificar...</i>.</p></td>
          </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Se quiser manusear um conjunto de pe&ccedil;as de mobili&aacute;rio como se fossem uma s&oacute;, seleccione-as e escolha
			 <i>Mob&iacute;lia &gt; Agrupar</i>. Um grupo de pe&ccedil;as aparece como uma pe&ccedil;a &uacute;nica na lista, podendo ser movida, 
			 redimensionada e rodada como se fosse uma s&oacute; pe&ccedil;a na planta.</p></td>
          </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Se quiser mover uma pe&ccedil;a (ou um grupo) num grupo existente, seleccione-a, escolha <i>Editar &gt; Cortar</i>, 
            e depois seleccione o grupo destino e escolha <i>Editar &gt; Colar no grupo</i>.</p></td>
          </tr>          
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>Quando escolhe <i>Editar &gt; Copiar </i>ou <i>Editar &gt; Cortar</i>, os objectos seleccionados na lista de mob&iacute;lia
			s&atilde;o tamb&eacute;m copiados para a &aacute;rea de transfer&ecirc;ncia como texto em formato CSV, que pode depois colar num 
			editor de texto (como o Notepad++) ou numa folha de c&aacute;lculo (como o OpenOffice). Esta funcionalidade pode n&atilde;o funcionar
			num sistema Linux.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <TD colspan="2"> <P><B>Planta</B></P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Se tiver uma imagem digitalizada da planta da sua casa &agrave; sua disposi&ccedil;&atilde;o, importe-a como 
			<a href="importingBackground.html">imagem de fundo</a> da planta primeiro. Esta funcionalidade acelera o processo de desenhar as 
			paredes.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>Para definir exatamente a escala da imagem de fundo importada, amplie o painel do Assistente de imagem de fundo. </P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Se quer definir cores diferentes no lado de uma parede partilhada por divis&otilde;es adjacentes, divida-a em m&uacute;ltiplos 
			segmentos durante a sua <a href="drawingWalls.html">cria&ccedil;&atilde;o</a> ou escolhendo <i>Planta &gt; Dividir parede</i>.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>Para construir as paredes inclinadas de um s&oacute;t&atilde;o, <a href="editingWalls.html">escolha</a> alturas diferentes para 
			os seus pontos inicial e final.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Quando escolhe <i>Editar &gt; Copiar </i>ou <i>Editar &gt; Cortar</i>, os objectos seleccionados na planta s&atilde;o
			tamb&eacute;m copiados para a &aacute;rea de transfer&ecirc;ncia como uma imagem, que poder&aacute; colar noutra aplica&ccedil;&atilde;o
			(esta funcionalidade poder&aacute; n&atilde;o funcionar em Linux). Se preferir a imagem da planta num formato vetorial, escolha 
			<i>Planta &gt; Exportar para formato SVG...</i>.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Para copiar o estilo de um objecto para outros objectos do mesmo tipo sem mostrar os seus pain&eacute;is de modifica&ccedil;&atilde;o, 
            seleccione o objecto, escolha <i>Editar &gt; Copiar</i> ou <i>Editar &gt; Cortar</i> e depois seleccione os objectos que
            quer modificar e escolha <i>Editar &gt; Colar estilo</i>.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Use as setas no teclado para mover a mob&iacute;lia com precis&atilde;o.</P></TD>
          </TR>
          <tr valign="top"> 
            <td><p>&#149;</p></td>
            <td> <p>Bloqueie a planta base para seleccionar e dispor <a href="editingFurniture.html">mob&iacute;lia</a> sem ser incomodado por outros 
			tipos de objectos mostrados na planta.</p></td>
          </tr>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P> Se quer seleccionar um objecto que est&aacute; escondido por outros na planta da casa, se &eacute; uma pe&ccedil;a de mob&iacute;lia&nbsp;; 
			tamb&eacute;m pode seleccionar qualquer tipo de objecto pondo o cursor do rato onde os objectos se sobrep&otilde;em e depois seleccionando o 
			objecto escondido no menu contextual <i>Seleccionar objecto</i>. Finalmente, pode tamb&eacute;m seleccionar um objecto na planta com uma 
			selec&ccedil;&atilde;o que o inclua, na qual remove a selec&ccedil;&atilde;o aos objectos que o escondem com um clique e mantendo 
			premida a tecla <i>Shift</i>.</P></TD>
          </TR>
		  <tr valign="top">
			<td><p>&#149;</p></td>
			<td><p>Se quer remover a se&ccedil;&atilde;o de um objecto entre outros seleccionados na planta, mantenha premida a tecla <i>Shift</i>
				   enquanto clica no objecto. Se o objecto estiver escondido por outro, pode escolh&ecirc;-lo no menu contextual <i>Alternar  
				   selec&ccedil;&atilde;o</i> que substitui o menu <i>Seleccionar objecto</i> quando prime a tecla <i>Shift</i>.</p></td>
		  </tr>
          <tr valign="top"> 
            <td width="16"><p>&#149;</p></td>
            <td> <p>Use linhas de alinhamento para o ajudar a desenhar paredes, divis&otilde;es e linhas de dimens&atilde;o com precis&atilde;o.</p></td>
          </tr>
          <tr valign="top">
            <td><p>&#149;</p></td>
            <td><p>Para mover objectos seleccionados ao longo dos seus eixos vertical ou horizontal, use as setas no teclado ou arraste e largue
			estes objectos, pressionando a tecla <i>Shift</i> depois de os ter come&ccedil;ado a arrastar.</p></td>
          </tr>
          <tr valign="top"> 
            <td><p>&#149;</p></td>
            <td> <p>Para duplicar objectos seleccionados na planta, arraste-os e largue-os mantendo pressionada a tecla <i>Ctrl</i> (ou <i>alt</i>
			num sistema Mac OS X).</p></td>
          </tr>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>A ativa&ccedil;&atilde;o do Magnetismo, definida nas <a href="editingPreferences.html">prefer&ecirc;ncias</a>, pode ser
			temporariamente desactivada na planta, pressionando <i>Alt</i> no Windows, <i>cmd</i> em Mac OS X ou <i>Shift</i> +<i> Alt</i> em Linux.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Para o ajudar a desenhar paredes e colocar mob&iacute;lia, <a href="editing3DView.html">altere</a> o ponto de vista e/ou a
			transpar&ecirc;ncia das paredes na vista 3D da sua casa.</P></TD>
          </TR>
          <tr valign="top"> 
            <td><p>&#149;</p></td>
            <td> <p>Para alinhar mob&iacute;lia, seleccione as pe&ccedil;as e escolha uma das hip&oacute;teses dispon&iacute;veis em 
			<i>Mob&iacute;lia &gt; Alinhar</i>. As pe&ccedil;as ser&atilde;o alinhadas pela primeira pe&ccedil;a seleccionada.</p></td>
          </tr>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Para alterar a parte vis&iacute;vel da planta sem mover as barras de deslizamento que a rodeiam, use o modo Arrastar escolhendo
			<i>Planta &gt; Arrastar</i>. Quando outro modo estiver activado na planta, este modo pode ser activado temporariamente pressionando 
			<i>Barra de espa&ccedil;os</i>. </P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Escolha <i>Planta &gt; Ampliar</i> ou <i>Planta &gt; Reduzir</i> para alterar a escala da planta, ou use a roda do rato 
			mantendo a tecla <i>Ctrl</i> pressionada (ou <i>cmd</i> em Mac OS X). No &uacute;ltimo caso, a amplia&ccedil;&atilde;o &eacute; centrada 
			na localiza&ccedil;&atilde;o do cursor do rato.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <TD colspan="2"> <P><B>Vista 3D da casa</B></P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Escolha <i>Vista 3D &gt; Mostrar em janela separada</i> para colocar a vista 3D num local diferente do monitor ou mesmo noutro
			monitor. Para voltar a ligar a vista 3D &agrave; janela principal, escolha <i>Vista 3D &gt; Mostrar na janela principal</i> ou feche a 
			janela da vista 3D.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Pressione a tecla <i>Shift</i> para aumentar o efeito dos movimentos do rato e da roda do rato na vista 3D.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P> Se n&atilde;o consegue ver alguma mob&iacute;lia nalgumas divis&otilde;es, <a href="editing3DView.html">modifique</a> a
			transpar&ecirc;ncia das paredes. </P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P> Se algumas paredes, ch&atilde;os de divis&otilde;es ou mob&iacute;lia est&atilde;o muito claros, <a href="editing3DView.html">modifique</a> 
			o brilho da ilumina&ccedil;&atilde;o. </P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P> Se n&atilde;o sabe onde est&aacute; localizado o visitante virtual, rode a roda do rato com o ponteiro na vista 3D, o visitante
			ser&aacute; automaticamente seleccionado e mostrado na planta.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>Use <i>Vista 3D &gt; Armazenar ponto de vista...</i> para gravar os pontos de vista principais, onde ser&aacute; poss&iacute;vel 
			voltar mais tarde diretamente usando <i>Vista 3D &gt; Ir para ponto de vista</i>. A hora, data e lente definidas na janela 
			<i>Criar fotografia</i> s&atilde;o tamb&eacute;m armazenadas com o ponto de vista. Se necess&aacute;rio, escolha <i>Vista 3D &gt; 
			Apagar pontos de vista...</i> para seleccionar os pontos de vista que deseja remover.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td><p>&#149;</p></td>
            <TD> <P>Por predefini&ccedil;&atilde;o, as imagens geradas com as janelas <i>Criar fotografia</i> e <i>Criar v&iacute;deo</i> nos dois 
			melhores n&iacute;veis de qualidade s&atilde;o iluminadas por luzes colocadas no centro dos tectos de cada 
			<a href="drawingRooms.html">divis&atilde;o</a> e pela luz do Sol durante o dia. Pode melhorar a ilumina&ccedil;&atilde;o removendo a selec&ccedil;&atilde;o
			da caixa <i>Adicionar luzes de tecto</i> nestas janelas, alterar a hora actual, a orienta&ccedil;&atilde;o da b&uacute;ssola, adicionando mais 
			fontes de luz e/ou ajustando a sua pot&ecirc;ncia.</P></TD>
          </TR>
          <TR VALIGN="top"> 
            <td width="16"><p>&#149;</p></td>
            <TD> <P>Pode <a href="savingHome.html"> exportar</a> a vista 3D para o formato .OBJ e importar o ficheiro .OBJ criado com outro programa,
			como por exemplo o <a href="http://aoi.sourceforge.net">Art of Illusion</a> ou o <a href="http://www.blender.org">Blender</a>.</P></TD>
          </TR>
        </TABLE></td>
    </tr>
  </table>
</div>
	</body>

</html>
