<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Adicionar portas, janelas e mob&#237;lia</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocCreating.html">Criar
						      casas, paredes e mob&#237;lia</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Adicionar portas, janelas e mob&#237;lia</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Para adicionar portas, janelas ou mob&#237;lia &#224; sua casa, arraste e largue objectos do cat&#225;logo ou lista de mob&#237;lia para 
	a planta, um por um. </p>
	  <p align="center"><img src="images/addingFurniture.png" alt="Adding furniture" width="435" height="179"></p>
	  <p align="left">Pode tamb&#233;m seleccionar uma ou mais pe&#231;as no cat&#225;logo e depois escolher 
	  <i>Mob&#237;lia &gt; Adicionar &#224; casa</i> ou clicar na ferramenta  <img src="../images/addToHomeTool.png" alt="Add to home tool" width="24" height="24" align="absmiddle">&nbsp; 
		 <i>Adicionar mob&#237;lia seleccionada do cat&#225;logo &#224; casa</i> </p>
	    </blockquote>	  
	  <p align="left">Quando as pe&#231;as s&#227;o largadas na lista de mob&#237;lias ou adicionadas pelo Menu 
	  <i>Mob&#237;lia &gt; Adicionar &#224; casa</i>, a localiza&#231;&#227;o do seu canto superior esquerdo est&#225; no ponto (0, 0).<br>
Quando uma pe&#231;a &#233; largada numa planta, a sua localiza&#231;&#227;o e orienta&#231;&#227;o dependem da localiza&#231;&#227;o das paredes 
perto da pe&#231;a. Se a pe&#231;a largada for uma porta ou uma janela, &#233; rodada automaticamente e redimensionada de acordo com a 
orienta&#231;&#227;o e espessura da parede que interceta. Os outros tipos de pe&#231;as ser&#227;o rodados de forma a que a sua parte de tr&#225;s 
fique virada para a parede mais pr&#243;xima que a pe&#231;a poderia intercetar.</p>
<p align="left">As pe&#231;as adicionadas &#224; casa s&#227;o seleccionadas e desenhadas simultaneamente na lista de mob&#237;lia, na planta e na
 vista 3D. Durante o tempo de carregamento das pe&#231;as adicionadas no modelo 3D, estas pe&#231;as s&#227;o representadas como uma caixa branca 
 na vista 3D.</p>
<p align="left">Se quiser adicionar uma pe&#231;a a um grupo de mob&#237;lia existente, seleccione o grupo destino e escolha 
				<i>Mob&#237;lia &gt; Adicionar ao grupo</i>.
</p></td>
	</tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se o cat&#225;logo n&#227;o contiver a pe&#231;a de mobili&#225;rio que quer adicionar &#224; sua casa, escolha a pe&#231;a 
			  <i>Caixa</i> na categoria <i>V&#225;rios</i> e redimensione-a, ou <a href="importingFurniture.html">importe-a</a> de outra 
			  biblioteca de mobili&#225;rio.</p>
            </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Uma pe&#231;a de mobili&#225;rio qualificada como porta ou janela indica ao Sweet Home 3D para abrir automaticamente espa&#231;os 
			  nas paredes no ponto de intercep&#231;&#227;o com as portas ou janelas. Semelhantemente, uma escada &#233; capaz de fazer uma 
			  abertura no tecto e no ch&#227;o dos pisos superiores. Este processo n&#227;o &#233; executado para outro tipo de mob&#237;lia. </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Se uma pe&#231;a de mobili&#225;rio for largada em cima de outra, ser&#225; elevada para aparecer por cima da outra, o seu 
			  ret&#226;ngulo de selec&#231;&#227;o &#233; inclu&#237;do no da outra pe&#231;a e a sua eleva&#231;&#227;o predefinida &#233; 
			  igual a zero (i.e. ao n&#237;vel do ch&#227;o). Se o contorno da pe&#231;a largada intercetar o contorno de outra pe&#231;a, 
			  a pe&#231;a largada ser&#225; orientada com o mesmo &#226;ngulo e posicionada ao lado dessa pe&#231;a.</td></tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>O &#226;ngulo, profundidade e cota de uma pe&#231;a adicionada com o rato s&#243; s&#227;o automaticamente calculados se o 
			  magnetismo estiver activado nas <a href="editingPreferences.html">prefer&#234;ncias</a>.</p>
            </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
            <td>
              <p>Uma vez que uma pe&#231;a seja adicionada &#224; casa, pode <a href="editingFurniture.html">alterar</a> o seu nome, &#226;ngulo, 
			  localiza&#231;&#227;o, tamanho, cor e textura. Pode tamb&#233;m agrup&#225;-la com outras pe&#231;as seleccionando-as e escolhendo 
			  <i>Mob&#237;lia &gt; Agrupar</i>.</p>
            </td>
          </tr>
          <tr valign="top">
            <td>
              <p>&#149;</p>
            </td>
              <td> <p>Escolha <i>Planta &gt; Ampliar</i> ou <i>Planta &gt; Reduzir</i> para alterar a escala, ou utilize a roda do rato enquanto 
			  mantem pressionada a tecla <i>Ctrl</i> (ou <i>cmd</i> num sistema Mac OS X). </td>
          </tr>
          <tr valign="top">
            <td width="16">
              <p>&#149;</p>
            </td>
            <td>
              <p>A ferramenta <i>Seleccionar</i> <img src="../images/selectTool.png">&nbsp;  &#233; automaticamente seleccionada sempre que 
			  adiciona uma pe&#231;a de mobili&#225;rio &#224; casa.
			  </p>
            </td>
          </tr>
        </table>
       </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
