<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Editar mob&iacute;lia</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocEditing.html">Editar
										   prefer&ecirc;ncias, planta e vista 3D</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Editar mob&iacute;lia</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Pode editar a localiza&ccedil;&atilde;o, o tamanho, a cota e o &acirc;ngulo da mob&iacute;lia da casa com o rato ou escolhendo 
		   <i>Mob&iacute;lia &gt; Modificar...</i>.<br>
           Para editar pe&ccedil;as de mobili&aacute;rio com o rato, seleccione-as primeiro na planta da casa ou na lista de mob&iacute;lia. 
		   Clique numa pe&ccedil;a para a seleccionar. Para seleccionar m&uacute;ltiplas pe&ccedil;as na planta, desenhe uma 
		   selec&ccedil;&atilde;o rectangular &agrave; volta delas, ou clique nas pe&ccedil;as enquanto mant&eacute;m pressionada a tecla 
		   <i>shift</i>. <br>
		   Para evitar seleccionar mob&iacute;lia com outros tipos de objectos na planta, bloqueie a planta base, clicando no cadeado mostrado no
		   canto superior esquerdo da planta ou escolhendo <i>Planta &gt; Bloquear planta base</i>. Isto impede a selec&ccedil;&atilde;o de paredes, 
		   divis&otilde;es, cotas, textos livres, portas e janelas, para lhe permitir dispor a mob&iacute;lia mais facilmente. Clicar uma segunda 
		   vez no cadeado ou adicionar um objecto &agrave; planta que n&atilde;o seja uma pe&ccedil;a de mobili&aacute;rio desbloqueia a planta.<br>
		   Para mover as pe&ccedil;as seleccionadas, coloque o cursor do rato dentro da selec&ccedil;&atilde;o e arraste-as e largue-as ou use as 
		   setas do teclado. Quando o cursor do rato estiver em cima de uma parede quando largar <b>uma</b> pe&ccedil;a de mobili&aacute;rio, essa 
		   pe&ccedil;a &eacute; automaticamente rodada e redimensionada de acordo com a orienta&ccedil;&atilde;o e espessura da parede se for uma 
		   porta ou janela ou, se for outro tipo de pe&ccedil;a &eacute; orientada de forma a que a sua face traseira fique voltada para a parede.<br>
		   Se quer manusear um conjunto de pe&ccedil;as como se fossem uma s&oacute; (por exemplo, uma mesa e as cadeiras &agrave; volta dela),
		   escolha <i>Mob&iacute;lia &gt; Agrupar</i>.</p>
        <p>Quando <b>uma</b> pe&ccedil;a ou <b>um</b> grupo de pe&ccedil;as est&atilde;o seleccionadas na planta, pode tamb&eacute;m alterar o seu 
	       tamanho, cota ou &acirc;mgulo com um dos quatro indicadores que aparecem em cada canto da pe&ccedil;a seleccionada.</p>      
      <p align="center"><img src="../images/furnitureCorners.png" alt="Furniture corners" width="110" height="110"></p>
      </td>
  </tr>
</table>
<div id="taskbox"><table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
              <tr valign="top" BGCOLOR="#eeeeee">
                <td bgcolor="#eeeeee" width="98%">
                  <table border="0" cellspacing="0" cellpadding="4">
                    <tr valign="top">
                      <td nowrap><p>1.</p>
                      </td>
                      <td><p>O indicador de rota&ccedil;&atilde;o mostra o canto que pode arrastar para rodar a pe&ccedil;a seleccionada em torno do eixo vertical.</p>
                      </td>
                    </tr>
                    <tr valign="top">
                      <td nowrap><p>2.</p>
                      </td>
                      <td><p>O indicador de eleva&ccedil;&atilde;o mostra o canto que pode arrastar para alterar a cota da pe&ccedil;a seleccionada 
					  (em rela&ccedil;&atilde;o &agrave; cota do piso ao qual foi adicionada se a casa tiver 
					  <a href="addingLevels.html">m&uacute;ltiplos pisos</a>).</p>
                      </td>
                    </tr>
                    <tr valign="top">
                      <td nowrap><p>3.</p>
                      </td>
                      <td><p>O indicador de altura mostra o canto que pode arrastar para alterar a altura de uma pe&ccedil;a.<br>
							 Se o ângulo de rotação da peça em torno do eixo horizontal não for zero, este indicador permite actualizar o ângulo em vez da altura da peça. 
							 Se a pe&ccedil;a de mob&iacute;lia for uma fonte de luz ou um candeeiro contendo fontes de luz, este indicador &eacute;
							 um regulador de ilumina&ccedil;&atilde;o. Se quer modificar a altura deste tipo de objectos, edite os seus atributos 
							 como indicado no par&aacute;grafo seguinte.</p>
                      </td>
                    </tr>
                    <tr valign="top">
                      <td nowrap><p>4.</p>
                      </td>
                      <td><p>O indicador de tamanho mostra o canto que pode arrastar para alterar a largura e a profundidade da pe&ccedil;a 
							 seleccionada. Arrastar este indicador  numa peça rodada na horizontal ou enquanto mantém premido <i>Shift</i> actualiza 
							 proporcionalmente a largura, profundidade e altura da peça seleccionada.</p>
                      </td>
                    </tr>
                  </table>
                </td>
              </tr>
            </table>
  </div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Quando o ponteiro do rato est&aacute; sobre um destes cantos a sua forma altera-se, para indicar que pode arrastar e largar o canto para
		   alterar o atributo correspondente da pe&ccedil;a de mobili&aacute;rio. Enquanto pressiona o bot&atilde;o do rato, surge uma caixa com o 
		   valor do atributo a ser editado.<br>
		   A mob&iacute;lia modificada com o rato &eacute; desenhada simultaneamente na planta e na vista 3D.</p>
	    <p>Pode tamb&eacute;m editar as pe&ccedil;as de mobili&aacute;rio na sua pr&oacute;pria janela, fazendo duplo clique na pe&ccedil;a na 
		   planta ou na lista de mob&iacute;lia, ou escolhendo <i>Mob&iacute;lia &gt; Modificar...</i> depois de a ter seleccionado.</p>
	    <p align="center"><img src="images/editingFurniture.png" alt="Modificar mob&iacute;lia"></p>>
	    <p>Na janela de edi&ccedil;&atilde;o de mob&iacute;lia, pode alterar o seu nome, a abcissa (X) e a ordinal (Y) do seu centro, a sua cota 
		   (dist&acirc;ncia do seu fundo ao ch&atilde;o) e as suas largura, profundidade, altura, cor ou textura, o seu brilho, a sua visibilidade,
		   o seu &acirc;ngulos de rota&ccedil;&atilde;o, se o seu nome &eacute; ou n&atilde;o mostrado na planta e se a forma 3D do modelo deve ser 
		   espelhada. Não é possível rodar portas, janelas, escadas e grupos em torno de um eixo horizontal.<br>
		   Se tornar uma pe&ccedil;a invis&iacute;vel, ela n&atilde;o ser&aacute; desenhada na planta ou na vista 3D, mas continua a aparecer na 
		   lista de mob&iacute;lia para lhe permitir torn&aacute;-la vis&iacute;vel mais tarde.<br>
	       Quando uma pe&ccedil;a &eacute; editada (ou se as pe&ccedil;as seleccionadas s&atilde;o todas iguais), pode tamb&eacute;m clicar em 
		   <b>Modificar</b>,  mostrado ao lado da op&ccedil;&atilde;o <i>Materiais</i>, para substituir cada cor e/ou textura da pe&ccedil;a por
		   aquelas que escolher.</p>
	    <p align="center"><img src="images/editingMaterials.png" alt="Modify furniture"></p>
	    <p>A janela <i>Materiais da mob&iacute;lia</i> mostra a lista de materiais que pode editar e uma pr&eacute;-visualiza&ccedil;&atilde;o 3D 
		   das altera&ccedil;&otilde;es de cor e/ou textura que fez, porque os materiais nem sempre t&ecirc;m nomes claros ou bem traduzidos (como
		   <i>cach&atilde;o</i> em vez de <i>colch&atilde;o</i> ou <i>mordura</i> em vez de <i>moldura</i>). Pode tamb&eacute;m rodar o objecto na 
		   vista 3D com o rato, se necess&aacute;rio.</p></td>
	</tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Quando a coluna <i>Vis&iacute;vel</i> &eacute; mostrada na lista de mob&iacute;lia, a visibilidade da pe&ccedil;a de 
					  mobili&aacute;rio seleccionada pode ser alterada clicando diretamente na caixa <i>Vis&iacute;vel</i> na lista.</td>
            </tr>
            <tr valign="top">
              <td><p>&#149;</p></td>
              <td><p>Se quer modificar os atributos de um conjunto de pe&ccedil;as, seleccione-as e escolha <i>Mob&iacute;lia &gt; Modificar...</i>. 
                     Os valores dos atributos que forem diferentes nalgumas pe&ccedil;as deixam os campos respetivos da janela de 
					 edi&ccedil;&atilde;o em branco.</td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Use os itens do submenu <i>Planta &gt; Modificar estilo do texto</i> para alterar o tamanho e o estilo do tipo de letra usado
					  nos nomes da mob&iacute;lia seleccionada.</td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Se quer alinhar um conjunto de pe&ccedil;as, seleccione uma das op&ccedil;&otilde;es dispon&iacute;veis em 
					  <i>Mob&iacute;lia &gt; Alinhar</i>. As mob&iacute;lias s&atilde;o alinhadas pela primeira pe&ccedil;a seleccionada.</td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Uma pe&ccedil;a de mobili&aacute;rio qualificada como porta ou janela indica ao Sweet Home 3D que fa&ccedil;a automaticamente 
					  aberturas nas paredes na localiza&ccedil;&atilde;o dessas portas ou janelas. Para garantir que esta intercep&ccedil;&atilde;o 
					  &eacute; correctamente calculada, assegure-se que a profundidade da porta ou janela &eacute; sempre superior &agrave; 
					  espessura da parede na qual vai ser colocada. Este c&aacute;lculo n&atilde;o &eacute; feito para outros tipos de mob&iacute;lia.</td>
            </tr>
            <tr valign="top">
              <td><p>&#149;</p></td>
              <td><p>Quando a sua casa tem mais de um piso, uma escada &eacute; capaz de abrir automaticamente uma abertura no tecto e no ch&atilde;o 
					 do piso superior quando a sua altura for maior que a cota do piso acima.</td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Modificar a pot&ecirc;ncia das luzes s&oacute; tem algum efeito nas imagens calculadas pelas ferramentas de cria&ccedil;&atilde;o 
					  <a href="creatingPhotos.html">fotografia</a> ou <a href="creatingVideos.html">v&iacute;deo</a>, nos dois melhores n&iacute;veis
					  de qualidade dispon&iacute;veis para essas fotografias. Uma fonte de luz n&atilde;o tem representa&ccedil;&atilde;o f&iacute;sica
					  e pode ser vista, quando seleccionada, na vista 3D para provocar resposta.
              </td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Se uma pe&ccedil;a de mobili&aacute;rio for largada em cima de outra, ser&aacute; levantada para aparecer em cima da outra, 
					  quando o seu rect&acirc;ngulo de selec&ccedil;&atilde;o for inclu&iacute;do no da outra pe&ccedil;a excepto nalguns casos 
					  l&oacute;gicos como mob&iacute;lia largada numa planta. Se o contorno da pe&ccedil;a largada interseta o contorno de outra 
					  pe&ccedil;a, a pe&ccedil;a largada ser&aacute; posicionada ao longo da outra pe&ccedil;a. Estes comportamentos autom&aacute;ticos 
					  desaparecem se desativar o magnetismo.</td>
            </tr>
			  <tr valign="top">
				<td> <p>&#149;</p></td>
				<td>Quando arrasta ou move uma pe&ccedil;a de mob&iacute;lia, s&oacute; &eacute; automaticamente elevada ao topo de outra se a sua 
				eleva&ccedil;&atilde;o for igual a zero (no ch&atilde;o do piso seleccionado). Se quiser ajustar a eleva&ccedil;&atilde;o 
				ap&oacute;s a ter movido para cima de outro objecto, seleccione o item	de menu <i>Mob&iacute;lia &gt; Repor 
				eleva&ccedil;&atilde;o</i> para evitar ter de baixar a eleva&ccedil;&atilde;o da pe&ccedil;a para zero e ter de a mover.</td>
			  </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Se os objectos seleccionados na planta cont&ecirc;m paredes, divis&otilde;es, mob&iacute;lia, cotas e textos, todos estes 
					  objectos ser&atilde;o movidos por uma opera&ccedil;&atilde;o de arrastar e largar ou se usar as setas do teclado. Se mantiver
					  a tecla <i>Ctrl</i> pressionada (ou <i>alt</i>  em Mac OS X) enquanto arrasta e larga estes objectos, eles ser&atilde;o 
					  duplicados.</td>
            </tr>
            <tr valign="top"> 
              <td width="16"> <p>&#149;</p></td>
              <td> <p>Para o ajudar a manter o paralelismo, o &acirc;ngulo de uma pe&ccedil;a de mobili&aacute;rio &eacute;, por predefini&ccedil;&atilde;o, 
					  um m&uacute;ltiplo de  15&deg; . Pode desativar o magnetismo nas <a href="editingPreferences.html">prefer&ecirc;ncias</a> 
					  ou, durante a rota&ccedil;&atilde;o de uma pe&ccedil;a, mantendo pressionada a tecla <i>Alt</i> no Windows, <i>cmd</i> em
					  Mac OS X ou <i>Shift</i> +<i> Alt</i> em Linux. Da mesma forma, o &acirc;ngulo, a profundidade e a cota de uma pe&ccedil;a
					  movida s&oacute; pode ser automaticamente actualizada quando o magnetismo est&aacute; activado.</p></td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>As unidades mostradas nas sugest&otilde;es e na janela de edi&ccedil;&atilde;o de mob&iacute;lia s&atilde;o, por predefini&ccedil;&atilde;o, 
			     as do seu pa&iacute;s. Pode usar mil&iacute;metros, cent&iacute;metros, metros ou polegadas. Escolha-as nas <a href="editingPreferences.html">
				 prefer&ecirc;ncias</a>.  
			   </td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Escolha <i>Planta &gt; Modificar estilo do texto</i> para modificar o tamanho e o estilo do tipo de letra usado para os nomes 
					  duma pe&ccedil;a de mobili&aacute;rio. </td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Para o ajudar a colocar a mob&iacute;lia, <a href="editing3DView.html">altere</a> o ponto de vista e/ou a transpar&ecirc;ncia das 
					  paredes na vista 3D da sua casa.</td>
            </tr>
            <tr valign="top"> 
              <td> <p>&#149;</p></td>
              <td> <p>Pe&ccedil;as <a href="importingFurniture.html">importadas</a> para o cat&aacute;logo de mob&iacute;lia tamb&eacute;m podem
					  ser editados com um duplo clique.</td>
            </tr>
          </table>
      </td>
    </tr>
  </table>
</div>
</div>
</body>

</html>
