<html>
<head>
	<meta http-equiv="content-type" content="text/html;charset=iso-8859-1">
	<title>Editar a vista 3D</title>
	<link href="../help.css" rel="stylesheet" media="all">
</head>

<body  bgcolor="#ffffff">
<div id="banner">
	<div id="helpheader">
		<a class="bread" href="index.html">Ajuda do Sweet Home 3D</a> > <a class="bread" href="tocEditing.html">Editar
										   prefer&ecirc;ncias, paredes e mob&iacute;lia e a vista 3D</a>
	</div>
</div>
<div id="mainbox" align="left">
<table width="100%" border="0" cellspacing="0" cellpadding="0">
	<tr valign="bottom" height="32">
	<td width="3" height="32">&nbsp;</td>
	<td width="32" height="32"><img src="../images/applicationIcon32.png" alt="Sweet Home 3D Icon" height="32" width="32"></td>
	<td width="8" height="32">&nbsp;&nbsp;</td>
	<td valign="bottom" height="32"><font id="topic">Editar a vista 3D</font></td>
	</tr>
	<tr height="10">
	<td colspan="4" height="10">&nbsp;</td>
	</tr>
</table>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
	<tr>
	<td><p>Escolha <i>Vista 3D &gt; Vista a&eacute;rea</i> ou <i>Vista 3D &gt; Visitante virtual</i> para mudar entre dois pontos de vista propostos
		   na vista 3D.</p>
	  <table border="0" align="center" cellpadding="0" cellspacing="5">
	    <tr>
	      <td><img src="../images/aerialView.png" alt="Aerial view" width="290" height="214"></td>
	      <td><img src="../images/virtualVisit.png" alt="Virtual visit" width="290" height="214"></td>
	      </tr>
	    <tr align="center">
	      <td>Vista a&eacute;rea</td>
	      <td>Visitante virtual</td>
	      </tr>
	    </table>	 
		<p>Quando a <i>Vista a&eacute;rea</i> est&aacute; seleccionada, a vista 3D mostra a sua casa de um ponto de vista elevado. Neste modo, mover
		   o rato para a esquerda ou para a direita com o bot&atilde;o esquerdo pressionado faz com que a casa rode em torno de um eixo vertical,
		   localizado no centro da casa; mover o rato para a frente e para tr&aacute;s com o bot&atilde;o esquerdo pressionado faz com que a 
		   casa rode em torno de um eixo horizontal; usar a roda do rato aumenta ou reduz a amplia&ccedil;&atilde;o na vista 3D. <br>
        <p>Quando o <i>Visitante virtual</i> est&aacute; seleccionado, a vista 3D mostra a sua casa em tr&ecirc;s dimens&otilde;es do ponto de vista
		   de um visitante. Neste modo, mover o rato para os lados com o bot&atilde;o esquerdo pressionado faz com que o visitante se volte;
		   mover o rato para frente e para tr&aacute;s faz com que a cabe&ccedil;a do visitante se levante ou baixe; usar a roda do rato 
		   faz com que o visitante se mova para a frente ou para tr&aacute;s. </p>
        <p>Em ambos os modos, as setas <i>esquerda</i> e <i>direita</i> do teclado t&ecirc;m o mesmo efeito da desloca&ccedil;&atilde;o lateral do 
		   rato; as teclas <i>Page up</i> e <i>Page down</i> t&ecirc;m o mesmo efeito que mover o rato para a frente e para tr&aacute;s ; e as setas
          <i>para cima</i> e <i>para baixo</i> t&ecirc;m o mesmo efeito que a roda do rato. 
		<p>No modo <i>Visitante virtual</i>, pode tamb&eacute;m usar as teclas <i>Home</i> e <i>End</i> para levantar ou baixar o ponto de vista do 
		   visitante, assim como as teclas <i>Alt + seta esquerda</i> e <i>Alt + seta direita</i> para o mover para os lados.
		</p>
		<table border="0" align="center" cellpadding="0" cellspacing="5">
          <tr> 
            <td align="center"><img src="../images/3DNavigationPanel.png" alt="3D navigation arrows" width="58" height="61"></td>
            <td>As <a href="editingPreferences.html">prefer&ecirc;ncias</a> permitem-lhe mostrar ou ocultar as setas de navega&ccedil;&atilde;o no 
			    canto superior esquerdo da vista 3D. As setas para cima, para baixo, esquerda e direita t&ecirc;m o mesmo efeito que as suas 
				correspondentes do teclado, enquanto as duas pequenas setas no centro t&ecirc;m o mesmo efeito que as teclas <i>Page up</i> e 
				<i>Page down</i>.
			</td>
          </tr>
        </table>
        <p>Quando o <i>Visitante virtual</i> est&aacute; seleccionado, um visitante virtual visto de cima &eacute; desenhado na planta da casa. A sua
		   localiza&ccedil;&atilde;o e o seu &acirc;ngulo s&atilde;o actualizados em simult&acirc;neo na planta e na vista 3D, com cada movimento do 
		   visitante. Este visitante virtual est&aacute; rodeado por quatro indicadores.</p>
		<p align="center"><img src="../images/virtualVisitorIndicators.png" width="80" height="80"></p></td>
	</tr>
</table>
<div id="taskbox">
  <table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
    <tr valign="top" BGCOLOR="#eeeeee">
      <td bgcolor="#eeeeee" width="98%">
        <table border="0" cellspacing="0" cellpadding="4">
          <tr valign="top">
            <td nowrap><p>1.</p>
            </td>
            <td><p>O indicador do &acirc;ngulo da cabe&ccedil;a mostra o ombro que pode arrastar para mover a cabe&ccedil;a do visitante para cima ou 
			       para baixo.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>2.</p>
            </td>
            <td><p>O indicador do campo de vis&atilde;o mostra o &acirc;ngulo actualmente visto na vista 3D.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>3.</p>
            </td>
            <td><p>O indicador do &acirc;ngulo do corpo mostra o ombro que pode arrastar para mover o corpo do visitante para a direita ou para a
				   esquerda.</p>
            </td>
          </tr>
          <tr valign="top">
            <td nowrap><p>4.</p>
            </td>
            <td><p>O indicador da eleva&ccedil;&atilde;o dos olhos mostra o ponto que pode arrastar para mover o ponto de vista do visitante para 
				   cima ou para baixo.</p>
            </td>
          </tr>
        </table>
        </td>
    </tr>
  </table>
</div>
<table width="100%" border="0" cellspacing="0" cellpadding="3">
  <tr>
    <td><p>Quando o ponteiro do rato est&aacute; em cima de um dos ombros do visitante ou nas suas costas, pode arrastar e largar esses pontos para 
		   alterar o &acirc;ngulo da cabe&ccedil;a, o &acirc;ngulo do corpo ou a eleva&ccedil;&atilde;o do ponto de vista do visitante. Quando 
		   pressiona o bot&atilde;o do rato, surge uma caixa com o valor editado.<br>
           Pode tamb&eacute;m alterar a localiza&ccedil;&atilde;o do visitante virtual na planta da casa: arraste-o e largue-o onde quiser ou 
		   seleccione-o e desloque-o com as setas do teclado.<br>
           A localiza&ccedil;&atilde;o do visitante e os &acirc;ngulos anteriormente descritos podem ser definidos precisamente na janela do Visitante 
		   virtual, que surge quando faz duplo clique no visitante virtual na planta ou escolhendo <i>Vista 3D &gt; Modificar visitante virtual...</i>.
		</p>
      <p align="center"><img src="images/editingVirtualVisitor.png" alt="Editing virtual visitor"></p>
      <p>Esta janela tamb&eacute;m lhe permite alterar o campo de vis&atilde;o do visitante virtual e definir se a eleva&ccedil;&atilde;o total do
	     ponto de vista deve ser ajustada de acordo com o piso actualmente seleccionado, fazendo com que o visitante virtual suba ou des&ccedil;a
		 para o n&iacute;vel seleccionado.
	  </p>
      <p>Finalmente, escolhendo <i>Vista 3D &gt; Modificar a vista 3D...</i>, abre a janela Vista 3D que lhe permite alterar a cor e/ou a textura
         do piso e do c&eacute;u, o brilho da ilumina&ccedil;&atilde;o e a transpar&ecirc;ncia das paredes (e do ch&atilde;o).
	  </p>
        <p align="center"><img src="images/editing3DView.png"><br>
      </p></td>
  </tr>
</table>
<div id="taskbox">
<table width="100%" border="0" cellspacing="0" cellpadding="7" BGCOLOR="#eeeeee">
	<tr valign="top" BGCOLOR="#eeeeee">
	<td bgcolor="#eeeeee" width="98%">
	<table border="0" cellspacing="0" cellpadding="4"><tr valign="top"><td width="16"><p>&#149;
	</p>
	</td>
	<td>
		<p>Prima a tecla <i>Shift</i> para aumentar o efeito das teclas de seta, dos movimentos do rato e da roda do rato na Vista 3D.
		</p>
	</td>
	</tr>
	  <tr valign="top">
        <td><p>&#149;</p>
        </td>
        <td><p>As teclas  W, S, A e D produzem exatamente o mesmo efeito que as setas do teclado na Vista 3D.</p>
        </td>
	    </tr>
	  <tr valign="top">
	    <td width="16"><p>&#149;</p>
	      </td>
	    <td><p>Os movimentos na vista 3D e a modifica&ccedil;&atilde;o do visitante virtual n&atilde;o s&atilde;o consideradas opera&ccedil;&otilde;es 
			   irrevers&iacute;veis, mas a posi&ccedil;&atilde;o actual na vista 3D &eacute; <a href="savingHome.html">gravada</a> numa pasta do Sweet 
			   Home 3D, quando escolhe <i>Ficheiro &gt; Gravar</i> ou <i>Ficheiro &gt; Gravar como...</i>
			</p>
	      </td>
	    </tr>
	  <tr valign="top">
        <td><p>&#149;</p>
        </td>
        <td><p>As setas do teclado n&atilde;o t&ecirc;m o mesmo efeito no visitante virtual, dependendo de o foco estar na planta ou na Vista 3D. 
			   Quando o foco est&aacute; na planta, as setas movem o visitante da mesma forma que movem os outros objectos na planta.</p>
        </td>
	    </tr>
	  <tr valign="top">
        <td><p>&#149;</p>
        </td>
        <td><p>Mover o rato para a frente e para tr&aacute;s com o bot&atilde;o esquerdo e a tecla <i>Alt</i> pressionados tem o mesmo efeito que
               a roda do rato.</p>
        </td>
	    </tr>
	  <tr valign="top">
	    <td><p>&#149;</p></td>
	    <td><p>Nada impede o visitante virtual de estar dentro de uma parede ou muito longe da casa. Se n&atilde;o sabe onde est&aacute; o visitante
			   virtual, use a roda do rato com o ponteiro colocado na vista 3D, o visitante virtual ser&aacute; automaticamente seleccionado e 
			   mostrado na planta da casa.</p>
		</td>
	    </tr>
	  <tr valign="top">
	    <td><p>&#149;</p></td>
	    <td><p>No modo <i>Vista a&eacute;rea</i>, o observador gira &agrave; volta do centro da casa na Vista 3D e o seu centro &eacute; 
			   automaticamente actualizado de cada vez que os objectos s&atilde;o movidos ou redimensionados. Este comportamento assegura-lhe que 
			   ver&aacute; sempre toda a sua casa, sendo imposs&iacute;vel perder-se na Vista 3D. Se quer usar um ponto de vista que n&atilde;o 
			   dependa deste modo centrado, pode ativar a op&ccedil;&atilde;o <i>Vista a&eacute;rea centrada na selec&ccedil;&atilde;o</i> nas 
			   <a href="editingPreferences.html">prefer&ecirc;ncias</a> para centrar a vista 3D a&eacute;rea  nos itens seleccionados na planta da 
			   casa, ou usar o modo <i>Visitante virtual</i> que lhe permite escolher qualquer ponto de vista. Se quer ver algumas divis&otilde;es 
			   escondidas por paredes, pode tamb&eacute;m definir a transpar&ecirc;ncia das paredes na janela de modifica&ccedil;&atilde;o da Vista 
			   3D.</p>
		</td>
	    </tr>
	  <tr valign="top">
	    <td><p>&#149;</p></td>
	    <td><p>A op&ccedil;&atilde;o <i>Ajustar a eleva&ccedil;&atilde;o dos olhos ao piso actual</i> est&aacute; seleccionada por predefini&ccedil;&atilde;o 
			   e s&oacute; est&aacute; dispon&iacute;vel se a casa em edi&ccedil;&atilde;o tiver mais de um <a href="addingLevels.html">piso</a>. 
			   Desmarque-a se quer manter a mesma eleva&ccedil;&atilde;o, seja qual for o piso seleccionado (provavelmente para um ponto de vista 
			   de fora da casa).</p>
		</td>
	    </tr>
	  <tr valign="top">
	    <td><p>&#149;</p>
	      </td>
	    <td><p>Se quer ver sempre todos os pisos na Vista 3D qualquer que seja o piso seleccionado, escolha <i>Vista 3D &gt; Mostrar todos os pisos</i>.
			   Para mostrar o piso seleccionado e todos os outros pisos abaixo, escolha <i>Vista 3D &gt; Mostrar piso seleccionado</i>.</p>
		</td>
	    </tr>
	</table>
	
	</td>
	</tr>
</table></div>
</div>
</body>

</html>
